import '../constant/app_string.dart';

List<Map<String, dynamic>> preExamQuestions = [
  //---------------------------8
  {
    "Q":
        "أي من العبارات الآتية يوضح الفرق الصحيح بين أجزاء الكاميرا الرقمية من حيث الوظيفة؟",
    "A1":
        "يقوم المستشعر بجمع الضوء من المشهد وتوجيهه إلى العدسة لتحويله إلى صورة رقمية.",
    "A2":
        "العدسة تجمع الضوء وتوجهه إلى المستشعر، بينما يقوم المستشعر بتحويل الضوء إلى إشارات كهربائية تُعالج لإنتاج الصورة.",
    "A3":
        "الغالق يستخدم لتخزين الصور الملتقطة، بينما المعالج يتحكم في مدة تعرض المستشعر للضوء.",
    "A4":
        "معين النظر هو المسؤول عن تحويل الصورة إلى ملف رقمي، بينما تقوم وحدة التخزين بعرض الصور فور التقاطها.",
    "type": 1,
    "level": AppString.understand,
    "goal": "يميز بين أجزاء كاميرا التصوير الرقمي من حيث الوظيفة.",
    "isTF": false
  },
  {
    "Q":
        "أي من العبارات التالية تعكس الفرق الصحيح بين مستشعرات CCD و CMOS من حيث الأداء ومعالجة الصور؟",
    "A1":
        "مستشعر CCD يستهلك طاقة أقل ويتميز بسرعة معالجة أعلى، بينما مستشعر CMOS يقدم جودة صورة أفضل لكنه أبطأ وأغلى.",
    "A2":
        "مستشعر CMOS أكثر شيوعًا لأنه يستهلك طاقة أقل ويوفر سرعة معالجة أعلى، بينما مستشعر CCD يقدم جودة صورة متميزة لكنه يستهلك طاقة أكبر ويعمل ببطء.",
    "A3":
        "مستشعر CCD هو الأكثر استخدامًا في الكاميرات الرقمية الحديثة نظرًا لكفاءته في معالجة الصور مقارنة بمستشعر CMOS.",
    "A4":
        "مستشعر CCD يقدم صورًا عالية الجودة لكنه أقل كفاءة في استهلاك الطاقة، بينما مستشعر CMOS أبطأ في المعالجة وأكثر كفاءة في استهلاك الطاقة.",
    "type": 1,
    "level": AppString.analysis,
    "goal": "يقارن بين مستشعرات CCD و CMOS من حيث األداء.",
    "isTF": false
  },
  {
    "Q":
        "أي من العبارات التالية تفسر بشكل صحيح تأثير حجم المستشعر على جودة الصورة في الإضاءة المنخفضة؟",
    "A1":
        "المستشعرات الأكبر مثل Full Frame توفر صورًا أفضل في الإضاءة المنخفضة لأنها تستقبل كمية أكبر من الضوء، مما يحسن التفاصيل والألوان.",
    "A2":
        "المستشعرات الأصغر تقدم جودة صورة أعلى في الإضاءة المنخفضة لأنها تقلل من كمية الضوء الداخلة إلى الكاميرا.",
    "A3":
        "لا يؤثر حجم المستشعر على جودة الصورة في الإضاءة المنخفضة، فجميع المستشعرات تعمل بنفس الكفاءة بغض النظر عن حجمها.",
    "A4":
        "المستشعرات الكبيرة مثل Full Frame تقلل من جودة الصورة في الإضاءة المنخفضة لأنها تحتاج إلى مزيد من الطاقة لمعالجة الصور.",
    "type": 1,
    "level": AppString.analysis,
    "goal": "يفسر تأثير حجم المستشعر على جودة الصورة في الإضاءة المنخفضة.",
    "isTF": false
  },
  {
    "Q":
        "إذا كنت تريد تصوير سباق سيارات سريع، أي نوع من أنواع الغالق ستختار للحصول على صور حادة وواضحة دون تشويه؟",
    "A1": "الغالق الميكانيكي هو الخيار الأفضل لأنه أسرع وأكثر دقة.",
    "A2":
        "الغالق الإلكتروني مناسب للتصوير السريع لأنه يعتمد على حركة فيزيائية، مما يجعله أكثر دقة في اللقطات المتتابعة.",
    "A3":
        "الغالق الميكانيكي يستخدم التيار الكهربائي فقط، مما يجعله أسرع وأكثر كفاءة في تصوير مشاهد الحركة السريعة.",
    "A4":
        "الغالق الإلكتروني، لأنه أسرع ويمنع التشوه في الصور عند التصوير المتتابع.",
    "type": 1,
    "level": AppString.application,
    "goal": "يختار بين الغالق الميكانيكي والإلكتروني وفًقا لمتطلبات التصوير.",
    "isTF": false
  },
  {
    "Q":
        "أي من العبارات التالية تميز بشكل صحيح بين أنواع معين النظر من حيث الوظيفة؟",
    "A1":
        "المعين البصري يعرض صورة رقمية لما ستلتقطه الكاميرا، بينما المعين الإلكتروني (EVF) يعكس الصورة القادمة من العدسة مباشرة.",
    "A2":
        "المعين الإلكتروني (EVF) يعرض صورة رقمية تحاكي ما سيظهر في الصورة النهائية، بينما المعين البصري ينقل الصورة القادمة من العدسة مباشرة دون أي معالجة رقمية.",
    "A3":
        "المعين الإلكتروني (EVF) يعرض الصورة بشكل أكثر دقة، لكنه قد يكون أقل كفاءة في الإضاءة المنخفضة مقارنةً بالمعين البصري.",
    "A4":
        "المعين البصري يعالج الصورة رقميًا قبل عرضها، بينما المعين الإلكتروني (EVF) يعرض الصورة دون أي تعديل.",
    "type": 1,
    "level": AppString.understand,
    "goal": "يميز بين أنواع معين النظر من حيث الوظيفة.",
    "isTF": false
  },
  {
    "Q":
        "الدور الأساسي للشاشة الخلفية في الكاميرا الرقمية هو...................",
    "A1": "عرض الصور بعد التقاطها فقط.",
    "A2": "التحكم في إعدادات الكاميرا وكذلك التحكم في زوايا التصوير.",
    "A3": "عرض مستوى البطارية وسعة التخزين المتبقية.",
    "A4":
        "التأثير على جودة الصور التي تلتقطها الكاميرا، حيث تزيد من دقة الألوان والتفاصيل في الصور النهائية.",
    "type": 1,
    "level": AppString.understand,
    "goal": "يصف دور الشاشة الخلفية في ضبط الإعدادات.",
    "isTF": false
  },
  {
    "Q":
        "كل ما يلي من أنواع بطاقة الذاكرة المستخدمة في كاميرا التصوير الرقمي ماعدا .................",
    "A1": "SD",
    "A2": "Micro SD",
    "A3": "CD",
    "A4": "CF",
    "type": 1,
    "level": AppString.remember,
    "goal": "يذكر أنواع بطاقات الذاكرة المستخدمة في الكاميرات الرقمية.",
    "isTF": false
  },
  {
    "Q": "أي من العبارات التالية يوضح دور المعالج في تحسين جودة الصورة؟",
    "A1": "يقوم المعالج بتجميع الضوء من العدسة وتحويله إلى إشارات كهربائية.",
    "A2": "يعمل المعالج على تقليل الضوضاء، وتحسين توازن الألوان.",
    "A3": "يتحكم المعالج في فتحة العدسة وسرعة الغالق لتعديل التعريض الضوئي.",
    "A4": "يقوم المعالج بتخزين الصور على بطاقة الذاكرة دون أي تعديل أو تحسين.",
    "type": 1,
    "level": AppString.understand,
    "goal": "يشرح دور المعالج في تحسين جودة الصورة.",
    "isTF": false
  },
  //--------------------------12
  {
    "Q": "البكسل (Pixel) هو.................",
    "A1": "وحدة قياس حساسية الكاميرا للضوء.",
    "A2": "أصغر وحدة في الصورة الرقمية.",
    "A3": "مقدار فتحة العدسة في الكاميرا.",
    "A4": "مدة التعريض الضوئي.",
    "type": 2,
    "level": AppString.remember,
    "goal": "يذكر مفهوم البكسل.",
    "isTF": false
  },
  {
    "Q": "كيف يؤثر عدد الميغابكسل على جودة الصورة؟",
    "A1": "كلما زاد عدد الميغابكسل، زادت دقة التفاصيل في الصورة.",
    "A2": "تقليل عدد الميغابكسل يجعل الصورة أكثر وضوحًا.",
    "A3": "عدد الميغابكسل وحده لا يكفي للحصول على صورة عالية الجودة.",
    "A4":
        "زيادة عدد الميغابكسل يحسن جودة الصورة فقط عند وجود مستشعر كبير يمكنه الاستفادة من هذه الدقة.",
    "type": 2,
    "level": AppString.understand,
    "goal": "يشرح كيف يؤثر عدد الميغابكسل على جودة الصورة.",
    "isTF": false
  },
  {
    "Q":
        "يعد ضبط فتحة العدسة أمرًا مهمًا في التصوير الرقمي لأنها...................",
    "A1": "تؤثر على كمية الضوء الداخلة إلى المستشعر وعمق المجال.",
    "A2": "تحدد مدة التعريض للضوء.",
    "A3": "تقلل من التشويش (Noise) في الصور منخفضة الإضاءة.",
    "A4": "تتحكم في عدد الميغابكسل في الصورة النهائية.",
    "type": 2,
    "level": AppString.understand,
    "goal": "يوضح أهمية ضبط فتحة العدسة.",
    "isTF": false
  },
  {
    "Q":
        "إذا كنت تريد تصوير منظر طبيعي بحيث تظهر جميع التفاصيل بوضوح، أي فتحة عدسة يجب أن تختار؟",
    "A1": "f/1.4",
    "A2": "f/2.8",
    "A3": "f/11",
    "A4": "f/2.0",
    "type": 2,
    "level": AppString.application,
    "goal": "يضبط فتحة العدسة المناسبة حسب نوع التصوير.",
    "isTF": false
  },
  {
    "Q": "تؤثر الفتحة f/1.8 على خلفية الصورة حيث أنها ......................",
    "A1": "تجعل الخلفية أكثر وضوحًا وحادة.",
    "A2": "تجعل الخلفية ضبابية مما يساعد في التركيز على الهدف الرئيسي.",
    "A3": "تقلل من كمية الضوء الداخلة، مما يؤدي إلى صورة داكنة جدًا.",
    "A4": "تزيد من تأثير التشويش (Noise) في الصورة.",
    "type": 2,
    "level": AppString.analysis,
    "goal": "يقارن بين تأثير الفتحات الواسعة والضيقة على وضوح الخلفية.",
    "isTF": false
  },
  {
    "Q":
        "تعد سرعة الغالق أمرًا ضروريًا في الكاميرا الرقمية لأنها تساعد على ....................",
    "A1": "التحكم في كمية الضوء الداخلة إلى المستشعر فقط",
    "A2": "تحديد مدى حساسية الكاميرا للضوء.",
    "A3": "التحكم في مدة دخول الضوء.",
    "A4": "تحسين دقة الصورة من خلال زيادة عدد الميغابكسل.",
    "type": 2,
    "level": AppString.remember,
    "goal": "يذكر أهمية سرعة الغالق في الكاميرا الرقمية.",
    "isTF": false
  },
  {
    "Q":
        "تؤثر سرعة الغالق على وضوح العناصر المتحركة في الصورة حيث.....................",
    "A1": "كلما زادت سرعة الغالق، زاد تأثير الضبابية في الصورة",
    "A2":
        "كلما زادت سرعة الغالق ساعدت على تجميد الحركة، بينما السرعة المنخفضة تؤدي إلى ظهور تأثيرات الضبابية.",
    "A3": "كلما زادت سرعة الغالق قل وضوح العناصر المتحركة.",
    "A4": "كلما قلت سرعة الغالق زاد وضوح العناصر المتحركة.",
    "type": 2,
    "level": AppString.understand,
    "goal": "يفسر تأثير سرعة الغالق على وضوح العناصر المتحركة في الصورة.",
    "isTF": false
  },
  {
    "Q":
        "قمت بتصوير سباق سيارات، لكنك لاحظت أن الصور التي تقوم بالتقاطها تبدو ضبابية بسبب سرعة السيارات. ما الإعداد المناسب لسرعة الغالق للحصول على صورة واضحة دون ضبابية؟",
    "A1": "30/1 ثانية",
    "A2": "250/1 ثانية",
    "A3": "1000/1 ثانية",
    "A4": "5/1 ثانية",
    "type": 2,
    "level": AppString.application,
    "goal": "يختار سرعة الغالق لمواقف المناسبة التصوير المختلفة.",
    "isTF": false
  },
  {
    "Q": "ISO في الكاميرا الرقمية يعني .........................",
    "A1": "مقدار الضوء الذي تسمح العدسة بدخوله إلى الكاميرا.",
    "A2": "سرعة التقاط الصورة وتجميد الحركة.",
    "A3": "حساسية مستشعر الكاميرا للضوء.",
    "A4": "دقة الصورة الناتجة وعدد الميغابكسل.",
    "type": 2,
    "level": AppString.remember,
    "goal": "يحدد مفهوم ISO .",
    "isTF": false
  },
  {
    "Q":
        "إذا قمت بتصوير مشهد في غرفة ذات إضاءة خافتة، ولاحظت أن الصور تبدو مظلمة جدًا. ما الخيار الأفضل لضبط ISO للحصول على صورة أكثر وضوحًا؟",
    "A1": "ضبط ISO على قيمة (ISO 100)",
    "A2": "ضبط ISO على قيمة (ISO 400)",
    "A3": "ضبط ISO على قيمة (ISO 3200)",
    "A4": "تقليل ISO إلى أدنى مستوى ممكن.",
    "type": 2,
    "level": AppString.application,
    "goal": "يضبط قيمة ISO وفًقا لمستوى الإضاءة في بيئة التصوير.",
    "isTF": false
  },
  {
    "Q":
        "أي من العبارات التالية يوضح الفرق الصحيح بين الصور الملتقطة بـ ISO منخفض و ISO عالٍ؟",
    "A1":
        "الصور الملتقطة بـ ISO منخفض تحتوي على تفاصيل أوضح وضوضاء أقل، بينما الصور الملتقطة بـ ISO عالٍ قد تحتوي على تشويش (ضوضاء رقمية) أكثر.",
    "A2":
        "الصور الملتقطة بـ ISO منخفض تظهر أكثر سطوعًا من الصور الملتقطة بـ ISO عالٍ.",
    "A3":
        "الصور الملتقطة بـ ISO منخفض تحتاج إلى إضاءة جيدة للحصول على نتائج واضحة، بينما الصور الملتقطة بـ ISO عالٍ تكون أكثر سطوعًا ولكن مع فقدان بعض التفاصيل.",
    "A4":
        "الصور الملتقطة بـ ISO عالٍ تكون دائمًا أكثر وضوحًا وأفضل جودة من الصور الملتقطة بـ ISO منخفض.",
    "type": 2,
    "level": AppString.analysis,
    "goal": "يقارن بين صور ملتقطة بـ ISO منخفض وعاٍل لتوضيح تأثير التشويش.",
    "isTF": false
  },
  {
    "Q": "يساعد ضبط توازن اللون الأبيض في الكاميرا الرقمية على............",
    "A1": "تقليل حجم الصورة لتوفير مساحة التخزين.",
    "A2": "ظهور الألوان بشكل دقيق وطبيعي تحت مصادر الإضاءة المختلفة.",
    "A3": "زيادة حساسية الكاميرا للضوء في البيئات المظلمة.",
    "A4": "التحكم في كمية الضوء التي تدخل إلى المستشعر أثناء التصوير.",
    "type": 2,
    "level": AppString.understand,
    "goal": "يشرح أهمية ضبط توازن اللون الأبيض عند التصوير بالكاميرا الرقمية.",
    "isTF": false
  },
  // ------------------------11
  {
    "Q":
        "أي من العبارات التالية يوضح الفرق الصحيح بين أنواع العدسات المختلفة من حيث خصائصها؟",
    "A1":
        "العدسة Wide-Angle تستخدم لتقريب الأشياء البعيدة، بينما العدسة Telephoto تستخدم لتصوير المناظر الطبيعية.",
    "A2":
        "العدسة Zoom Lenses تتميز بطول بؤري ثابت وجودة بصرية عالية، بينما العدسة Prime Lenses تتيح تغيير الطول البؤري بمرونة.",
    "A3":
        "العدسة Telephoto تُستخدم لتقريب الأشياء البعيدة مثل الحيوانات، بينما العدسة Wide-Angle مناسبة لتصوير المناظر الطبيعية والفضاءات الواسعة.",
    "A4":
        "العدسة Prime Lenses تتيح تغيير الطول البؤري بحرية، بينما العدسة Zoom Lenses ذات طول بؤري ثابت لكنها تقدم جودة بصرية أعلى.",
    "type": 3,
    "level": AppString.understand,
    "goal": "يفرق بين أنواع العدسات المختلفة من حيث الخصائص.",
    "isTF": false
  },
  {
    "Q":
        "إذا كنت تريد تصوير مباراة رياضية من المدرجات، أي العدسات التالية تعد الأنسب، ولماذا؟",
    "A1": "عدسة بعد بؤري ثابت 50 mm",
    "A2": "عدسة واسعة الزاوية 24 mm",
    "A3": "عدسة تيليفوتو 200 mm",
    "A4": "عدسة ماكرو 100 mm",
    "type": 3,
    "level": AppString.evaluation,
    "goal": "يبرر اختيار عدسة معينة لتصوير حدث معين بناًء على خصائصها.",
    "isTF": false
  },
  {
    "Q": "عمق الميدان هو...........................",
    "A1": "المسافة بين الكاميرا والهدف.",
    "A2": "مدى وضوح العناصر في مقدمة وخلفية الصورة.",
    "A3": "مقدار التكبير الذي توفره العدسة.",
    "A4": "سرعة انتقال الضوء عبر العدسة.",
    "type": 3,
    "level": AppString.remember,
    "goal": "يعّرف مفهوم عمق الميدان.",
    "isTF": false
  },
  {
    "Q": "البعد البؤري للعدسة هو ........................",
    "A1": "قطر فتحة العدسة.",
    "A2": "المسافة بين الكاميرا والهدف.",
    "A3": "المسافة بين نقطة تجمع الضوء والمستشعر.",
    "A4": "مدى وضوح العناصر في مقدمة وخلفية الصورة.",
    "type": 3,
    "level": AppString.remember,
    "goal": "يذكر مفهوم البعد البؤري.",
    "isTF": false
  },
  {
    "Q": "أي من الخيارات التالية يؤدي إلى تقليل عمق الميدان؟",
    "A1": "استخدام عدسة بزاوية واسعة مع فتحة صغيرة (f/16)",
    "A2": "استخدام بعد بؤري طويل مع فتحة واسعة (f/1.4)",
    "A3": "زيادة المسافة بين الكاميرا والهدف مع فتحة صغيرة",
    "A4": "تقليل حساسية ISO إلى 100",
    "type": 3,
    "level": AppString.analysis,
    "goal": "يحلل العلاقة بين العوامل التي تؤثر على عمق الميدان.",
    "isTF": false
  },
  {
    "Q":
        "إذا كنت ترغب في تصوير شارع مزدحم بحيث تكون جميع التفاصيل من مقدمة الصورة إلى الخلفية واضحة، فما هو الإعداد الأنسب؟",
    "A1": "استخدام عدسة 85 mm مع فتحة f/2.8",
    "A2": "استخدام عدسة 24 mm مع فتحة f/11",
    "A3": "استخدام عدسة 200 mm مع فتحة f/4",
    "A4": "استخدام عدسة 50 mm مع فتحة f/1.8",
    "type": 3,
    "level": AppString.evaluation,
    "goal": "يقّيم تأثير اإلعدادات المختلفة للعدسات على جودة الصورة النهائية.",
    "isTF": false
  },
  {
    "Q":
        "كل ما يلي من العناصر الثلاثة الأساسية للتحكم في التعريض ما عدا......................",
    "A1": "فتحة العدسة",
    "A2": "البعد البؤري",
    "A3": "حساسية ISO",
    "A4": "سرعة الغالق",
    "type": 3,
    "level": AppString.remember,
    "goal": "يحدد العناصر الثلاثة المكونة للتعريض.",
    "isTF": false
  },
  {
    "Q":
        "إذا كنت تصور في بيئة منخفضة الإضاءة بدون فلاش، ما هو الإعداد الأنسب للحصول على تعريض جيد؟",
    "A1": "استخدام فتحة ضيقة (f/16) وسرعة غالق سريعة (1000/1) و ISO منخفض 100",
    "A2": "استخدام فتحة واسعة (f/1.8) وسرعة غالق بطيئة (30/1) و ISO مرتفع 800",
    "A3": "تقليل حساسية ISO إلى 50 وزيادة سرعة الغالق إلى 500/1.",
    "A4": "استخدام فتحة متوسطة (f/8) مع سرعة غالق سريعة جداً (2000/1)",
    "type": 3,
    "level": AppString.application,
    "goal":
        "يطبق التوازن بين الإعدادات للحصول على تعويض مناسب في ظروف اإلضاءة المختلفة.",
    "isTF": false
  },
  {
    "Q":
        "يساعد استخدام الـ Histogram في التحكم في التعريض عن طريق...................",
    "A1":
        "توضيح توزيع الإضاءة في الصورة لضمان عدم فقدان التفاصيل في الظلال والإضاءة الساطعة",
    "A2": "دمج تعريضات مختلفة لإظهار تفاصيل في الظلال والإضاءة الساطعة.",
    "A3": "ضبط توازن اللون الأبيض.",
    "A4": "تقليل كمية الضوء الداخل باستخدام سرعات غالق بطيئة.",
    "type": 3,
    "level": AppString.understand,
    "goal": "يشرح تقنيات التحكم في التعريض.",
    "isTF": false
  },
  {
    "Q":
        "يعد التحكم في التعريض أمرًا مهمًا في التصوير الرقمي لأنه....................",
    "A1": "يسمح بتغيير ألوان الصورة بعد التقاطها",
    "A2": "يؤثر على توازن الضوء والظل لإبراز التفاصيل بشكل صحيح",
    "A3": "يساعد في تقليل التشويش (Noise) في الإضاءة المنخفضة.",
    "A4": "يمنع ظهور الظلال القوية في الصور الملتقطة تحت أشعة الشمس المباشرة.",
    "type": 3,
    "level": AppString.understand,
    "goal": "يوضح أهمية التحكم في التعريض.",
    "isTF": false
  },
  {
    "Q":
        "أحد أصدقائك مصور هاوي يحب تصوير المناظر الطبيعية أثناء الرحلات، لكنه لاحظ أن الصور التي يقوم بالتقاطها لا تُظهر التفاصيل بوضوح في المقدمة والخلفية. فقرر شراء عدسة جديدة لتحسين جودة الصور. بما تنصحه؟",
    "A1": "عدسة f/1.8 بفتحة 85 mm",
    "A2": "عدسة f/11 بفتحة 24 mm",
    "A3": "عدسة f/2.8 بفتحة 70-200 mm",
    "A4": "عدسة f/2.8 بفتحة 100 mm ماكرو",
    "type": 3,
    "level": AppString.application,
    "goal": "يختارالعدسة المناسبة للشراء بناًء على متطلبات التصوير.",
    "isTF": false
  },
  // ------------------------11
  {
    "Q": "الإضاءة الطبيعية هي.......................",
    "A1": "تستخدم فقط في التصوير الداخلي.",
    "A2":
        "الإضاءة التي تأتي من مصادر مثل الشمس ويتميز بتأثيره على الألوان والظلال.",
    "A3": "الضوء الذي يتم توليده بواسطة الأجهزة الكهربائية.",
    "A4": "الضوء الذي يمكن التحكم فيه ليوافق احتياجات المصور الخاصة.",
    "type": 4,
    "level": AppString.remember,
    "goal": "يذكر مفهوم الإضاءة الطبيعية.",
    "isTF": false
  },
  {
    "Q":
        "يعد ............ من أنواع الضوء الطبيعي التي يفضل استخدامها لتصوير المناظر الطبيعية للحصول على صور دافئة وطبيعية.",
    "A1": "الضوء النهاري.",
    "A2": "الضوء في الأيام الغائمة.",
    "A3": "الضوء الصباحي والضوء المسائي (الضوء الذهبي).",
    "A4": "الضوء الصناعي.",
    "type": 4,
    "level": AppString.analysis,
    "goal": "يقارن بين تأثير الضوء الطبيعي بأنواعه المختلفة على جودة الصورة.",
    "isTF": false
  },
  {
    "Q":
        "يعد استخدام........................ من تقنيات التصوير في الإضاءة الطبيعية والتي يمكن تحسين جودة الصورة بتقليل الظلال القاسية.",
    "A1": "العواكس.",
    "A2": "الفلاش الخارجي.",
    "A3": "فلتر اللون.",
    "A4": "المظلات أو الصناديق الضوئية.",
    "type": 4,
    "level": AppString.understand,
    "goal": "يوضح تقنيات التصوير في الإضاءة الطبيعية.",
    "isTF": false
  },
  {
    "Q": "الإضاءة الاصطناعية هي...................",
    "A1": "الضوء الذي يتم إنتاجه بواسطة  مصادر طبيعية.",
    "A2": "الضوء الذي يتم توليده بواسطة الأجهزة أو الأضواء الكهربائية.",
    "A3": "الضوء الذي يأتي من الانعكاسات الطبيعية على الأسطح.",
    "A4": "الضوء الذي يتغير فقط في ساعات النهار.",
    "type": 4,
    "level": AppString.remember,
    "goal": "يحدد مفهوم الإضاءة الاصطناعية.",
    "isTF": false
  },
  {
    "Q":
        "إذا تم تكليفك بتصوير عرض أزياء في استوديو داخلي. و ترغب في إبراز تفاصيل الملبس والتصميمات بشكل قوي، مما يتطلب زيادة التباين بين الضوء والظلال للحصول على تأثير درامي. أي نوع من أنواع الضوء الاصطناعي يجب أن تستخدم لتحقيق هذا التأثير؟",
    "A1": "الضوء الناعم",
    "A2": "الضوء الموجه",
    "A3": "الضوء الصلب",
    "A4": "الضوء المنعكس",
    "type": 4,
    "level": AppString.application,
    "goal": "يوظف بأنواعه الاصطناعي ناًء على المختلفة ب الغرض من التصوير.",
    "isTF": false
  },
  {
    "Q":
        "يعد استخدام........... من تقنيات التصوير في الإضاءة الاصطناعية والتي تستخدم لتنعيم الضوء وتوزيعه بشكل أفضل.",
    "A1": "الفلاش والمصابيح الكبيرة",
    "A2": "المظلات أو الصناديق الضوئية",
    "A3": "فلتر اللون",
    "A4": "الضوء الصلب",
    "type": 4,
    "level": AppString.understand,
    "goal": "يوضح تقنيات التصوير في الإضاءة الاصطناعية.",
    "isTF": false
  },
  {
    "Q":
        "يمكن تحقيق التوازن بين الإضاءة الطبيعية والاصطناعية في التصوير الرقمي عن طريق.................",
    "A1": "استخدام الفلاش فقط لضمان سطوع الصورة",
    "A2": "تعديل تعريض الكاميرا ودرجة حرارة اللون",
    "A3": "استخدام الإضاءة الاصطناعية فقط لتجنب التباين بين الألوان",
    "A4": "تجنب استخدام الإضاءة الاصطناعية تمامًا في ظروف الإضاءة الطبيعية",
    "type": 4,
    "level": AppString.understand,
    "goal":
        "يشرح كيفية تحقيق التوازن بين الإضاءة الطبيعية والاصطناعية للحصول على صورة ذات إضاءة متناسقة.",
    "isTF": false
  },
  {
    "Q":
        "يستخدم .............. لتعديل التعريض عن طريق دمج صور متعددة بتعريضات مختلفة للحصول على تأثير ديناميكي في المشاهد ذات الإضاءة المتباينة.",
    "A1": "التعريض المزدوج",
    "A2": "التعديل خلال التصوير HDR",
    "A3": "التعريض باستخدام الفلتر",
    "A4": "تعديل سرعة الغالق",
    "type": 4,
    "level": AppString.understand,
    "goal": "يوضح تقنيات تعديل التعريض.",
    "isTF": false
  },
  {
    "Q":
        "أنت في موقع تصوير خارجي في يوم مشمس، وتحتاج إلى التقاط صورة بورتريه لشخص. والضوء الساطع يؤدي إلى ظلال قوية على الوجه. كيف يمكنك تعديل إعدادات الكاميرا لتقليل تأثير الظلال مع الحفاظ على توازن الإضاءة؟",
    "A1":
        "زيادة ISO إلى 3200 واستخدام سرعة غالق سريعة (1000/1 ثانية) لتقليل التعتيم.",
    "A2":
        "استخدام فتحة عدسة صغيرة (f/16) لزيادة عمق الميدان وتقليل الضوء الداخل.",
    "A3":
        "استخدام فتحة عدسة كبيرة (f/2.8) لزيادة كمية الضوء، وتقليل سرعة الغالق لتخفيف الظلال.",
    "A4":
        "استخدام سرعة غالق بطيئة (30/1 ثانية) لزيادة التعتيم وتجنب دخول الضوء الزائد.",
    "type": 4,
    "level": AppString.application,
    "goal": "تطبيق تقنيات تعديل التعريض لتحسين جودة الصورة النهائية.",
    "isTF": false
  },
  {
    "Q":
        "يؤدي زيادة ISO عند التصوير في الإضاءة المنخفضة إلى....................",
    "A1": "زيادة حساسية الكاميرا للضوء وتقليل التشويش.",
    "A2": "تحسين جودة الصورة دون التأثير على التفاصيل.",
    "A3": "زيادة ضوضاء الصورة وتشويشها.",
    "A4": "تقليل الضوء الملتقط وزيادة دقة الألوان.",
    "type": 4,
    "level": AppString.understand,
    "goal": "يشرح تأثير تطبيق تقنيات التصوير المختلفة في الإضاءة المنخفضة.",
    "isTF": false
  },
  {
    "Q":
        "إذا كنت تريد تصوير مشهد ليلي في مدينة مع إضاءة خافتة. كيف يمكنك تحقيق التوازن المثالي للإضاءة باستخدام تقنيات التصوير المناسبة؟",
    "A1": "استخدام فتحة عدسة ضيقة وسرعة غالق بطيئة",
    "A2": "استخدام ISO منخفضة وسرعة غالق سريعة",
    "A3": "استخدام ISO مرتفعة مع فتحة عدسة واسعة وسرعة غالق بطيئة",
    "A4": "استخدام سرعة غالق متوسطة للحصول على تأثير مثالي من الحركة",
    "type": 4,
    "level": AppString.application,
    "goal": "يطبق تقنيات التصوير في الإضاءة المنخفضة.",
    "isTF": false
  },
  // ------------------------------2
  {
    "Q":
        "أي من العبارات التالية تعبر بشكل صحيح عن الفرق بين صيغ حفظ الصور الرقمية؟",
    "A1": "صيغة JPEG توفر جودة أعلى من RAW لأنها تستخدم ضغًطا يقلل حجم الملف.",
    "A2":
        "صيغة TIFF مناسبة أكثر للطباعة الاحترافية مقارنة بـ JPEG لأنها تحافظ على التفاصيل والجودة دون فقدان.",
    "A3":
        "صيغة PNG تستخدم ضغًطا مفقوًدا مثل JPEG، مما يجعلها أصغر حجًما لكنها تفقد بعض التفاصيل.",
    "A4":
        "صيغة RAW أصغر حجًما من JPEG لأنها تحتوي فقط على البيانات الأساسية للصورة.",
    "type": 5,
    "level": AppString.analysis,
    "goal": "يقارن بين صيغ حفظ الصور الرقمية.",
    "isTF": false
  },
  {
    "Q":
        "إذا طلب منك تصميم شعار لشركة ناشئة، وتحتاج حفظ الشعار بصيغة تحافظ على جودته العالية مع إمكانية استخدامه في تصميمات مختلفة دون ظهور خلفية بيضاء. أي من الصيغ التالية هي الأنسب لهذا الاستخدام؟",
    "A1": "JPEG",
    "A2": "PNG",
    "A3": "TIFF",
    "A4": "RAW",
    "type": 5,
    "level": AppString.application,
    "goal": "يختار صيغة حفظ الصور الرقمية المناسبة للاستخدام.",
    "isTF": false
  },
];

List<int> preExamAnswers = [
  2,
  2,
  1,
  4,
  2,
  2,
  3,
  2,
  //----------8
  2,
  1,
  1,
  3,
  2,
  3,
  2,
  3,
  3,
  3,
  1,
  2,
  // ----------12
  3,
  3,
  2,
  3,
  2,
  2,
  2,
  2,
  1,
  2,
  2,
  // -----------11
  2,
  3,
  1,
  2,
  3,
  2,
  2,
  2,
  3,
  3,
  3,
  // -----------11
  2,
  2
];
