List<Map<int, dynamic>> firstExamQuestions = [
  {
    1: [
      {
        "q":
            "الوظيفة الأساسية للعدسة في الكاميرا الرقمية هي....................",
        "A1": "إمداد الكاميرا بالطاقة اللازمة للعمل",
        "A2": "جمع الضوء وتركيزه على المستشعر",
        "A3": "عرض الصور على الشاشة",
        "A4": "تخزين الصور على بطاقة الذاكرة",
        "a": 2,
        "Level": "I1EQ1",
        "isTF": false,
        "T": "تقوم العدسة بتجميع الضوء وإرساله إلى المستشعر للحصول على الصورة.",
      },
      {
        "q": "يُحدد ................ زاوية التصوير في العدسة.",
        "A1": "حجم المستشعر",
        "A2": "البعد البؤري",
        "A3": "نوع التركيز التلقائي",
        "A4": "سرعة الغالق",
        "a": 2,
        "Level": "I1EQ2",
        "isTF": false,
        "T": "زاوية التصوير تعتمد بشكل رئيسي على البعد البؤري للعدسة.",
      },
    ],
    2: [
      {
        "q": "الفرق الرئيس بين العدسات Prime وZoom هو ...................",
        "A1": "جودة الصورة",
        "A2": "الطول البؤري",
        "A3": "نوع التركيز",
        "A4": "حجم العدسة",
        "a": 2,
        "Level": "I1MQ1",
        "isTF": false,
        "T":
            "العدسات Prime تتميز بطول بؤري ثابت، بينما العدسات Zoom توفر تغييرًا مرنًا للطول البؤري.",
      },
      {
        "q":
            "يُطلق على العدسات التي يمكن تغيير الطول البؤري لها بمرونة اسم...................",
        "A1": "Prime Lenses",
        "A2": "Telephoto Lenses",
        "A3": "Wide-Angle Lenses",
        "A4": "Zoom Lenses",
        "a": 4,
        "Level": "I1MQ2",
        "isTF": false,
        "T":
            "Zoom Lenses تتيح تغيير الطول البؤري بسهولة، مما يجعلها متعددة الاستخدامات.",
      },
    ],
    3: [
      {
        "q":
            "أنت في رحلة تصوير طبيعية في جبال بعيدة وتريد تصوير المناظر الواسعة. أي نوع من العدسات سيكون الأنسب لاستخدامه في هذه الحالة؟",
        "A1": "عدسة Prime",
        "A2": "عدسة Zoom",
        "A3": "عدسة  Telephoto",
        "A4": "عدسة Wide-Angle",
        "a": 4,
        "Level": "I1HQ1",
        "isTF": false,
        "T":
            "عدسة الـ Wide-Angle هي الأنسب لتصوير المناظر الطبيعية والفضاءات الواسعة حيث توفر زاوية رؤية أوسع.",
      },
      {
        "q":
            "أنت في حدث رياضي وتحتاج إلى التقاط صور للاعبين من مسافة بعيدة. ما هي العدسة الأنسب للاستخدام في هذه الحالة؟",
        "A1": "عدسة  Wide-Angle",
        "A2": "عدسة  Zoom",
        "A3": "عدسة  Prime",
        "A4": "عدسة  Telephoto",
        "a": 4,
        "Level": "I1HQ2",
        "isTF": false,
        "T":
            "العدسات Telephoto هي الأفضل لتصوير الأشياء البعيدة مثل اللاعبين في الأحداث الرياضية. يمكنها التقريب بشكل كبير للحصول على تفاصيل دقيقة من بعيد.",
      },
    ],
  },
  {
    1: [
      {
        "q": "الوظيفة الأساسية للمستشعر في الكاميرا هي....................",
        "A1": "رؤية المشهد قبل التقاط الصورة",
        "A2": "تحويل الضوء إلى إشارات كهربائية",
        "A3": "تخزين الصور",
        "A4": "التحكم بزاوية التصوير",
        "a": 2,
        "Level": "I2EQ1",
        "isTF": false,
        "T":
            "المستشعر هو الجزء المسؤول عن تحويل الضوء القادم من العدسة إلى إشارات كهربائية تُعالج لإنتاج الصورة.",
      },
      {
        "q":
            "يؤثر حجم المستشعر الكبير مثل Full Frame في الصور من خلال ....................",
        "A1": "تحسين التركيز التلقائي",
        "A2": "تحسين الأداء في الإضاءة المنخفضة",
        "A3": "زيادة زاوية التصوير",
        "A4": "زيادة زاوية التصوير",
        "a": 2,
        "Level": "I2EQ2",
        "isTF": false,
        "T":
            "المستشعرات الأكبر تجمع مزيدًا من الضوء، مما يجعلها أفضل في ظروف الإضاءة المنخفضة.",
      },
    ],
    2: [
      {
        "q":
            "الفارق الرئيسي بين مستشعر CCD ومستشعر  CMOS هو...................",
        "A1": "CCD  أسرع في معالجة الصور",
        "A2": "CMOS  أقل استهلاكًا للطاقة",
        "A3": "CCD  أرخص في التصنيع",
        "A4": "CMOS  يقدم صورًا بجودة متميزة",
        "a": 2,
        "Level": "I2MQ1",
        "isTF": false,
        "T":
            " CMOS يُستهلك طاقة أقل ويُعالج الصور بسرعة، مما يجعله الخيار الأكثر استخدامًا.",
      },
      {
        "q":
            "يُعد المستشعر ..................... هو الأكثر شيوعًا في الكاميرات الرقمية بسبب كفاءته وسرعته.",
        "A1": "CCD",
        "A2": "Full Frame",
        "A3": "CMOS",
        "A4": "Micro Four Thirds",
        "a": 3,
        "Level": "I2MQ2",
        "isTF": false,
        "T":
            "هو المستشعر الأكثر شيوعًا لأنه يستهلك طاقة أقل ويُعالج الصور بسرعة.",
      },
    ],
    3: [
      {
        "q":
            "أنت في رحلة تصوير في بيئة مظلمة وتحتاج إلى أفضل جودة للصورة في ظل الإضاءة المنخفضة. أي نوع من المستشعرات سيكون الأنسب في هذه الحالة؟",
        "A1": "مستشعر  CCD",
        "A2": "مستشعر  CMOS",
        "A3": "مستشعر Full Frame",
        "A4": "مستشعر  APS-C",
        "a": 3,
        "Level": "I2HQ1",
        "isTF": false,
        "T":
            "مستشعر Full Frame هو الأفضل في الإضاءة المنخفضة حيث يوفر تفاصيل وألوان دقيقة بفضل حجمه الكبير مقارنة بأنواع المستشعرات الأخرى.",
      },
      {
        "q":
            "أنت تعمل على تصوير حدث رياضي وتتطلب الصورة سرعة عالية في المعالجة دون التأثير الكبير على البطارية. أي نوع من المستشعرات سيكون الأنسب لهذه المهمة؟",
        "A1": "مستشعر CMOS",
        "A2": "مستشعر  CCD",
        "A3": "مستشعر  Full Frame",
        "A4": "مستشعر APS-C",
        "a": 1,
        "Level": "I2HQ2",
        "isTF": false,
        "T":
            "مستشعر CMOS يتميز بسرعته العالية في المعالجة واستهلاكه الأقل للطاقة، مما يجعله الخيار الأفضل لتصوير الأحداث السريعة مثل الرياضة.",
      },
    ],
  },
  {
    1: [
      {
        "q": "الوظيفة الأساسية للغالق في الكاميرا هي ...................",
        "A1": "تجميع الضوء من المشهد",
        "A2": "التحكم في مدة تعرض المستشعر للضوء",
        "A3": "حمل الكاميرا بثبات",
        "A4": "تغيير زاوية التصوير",
        "a": 2,
        "Level": "I3EQ1",
        "isTF": false,
        "T":
            "الغالق هو المسؤول عن تحديد الوقت الذي يتعرض فيه المستشعر للضوء، مما يؤثر على سطوع الصورة."
      },
      {
        "q": "يتحكم الغالق مباشرةً في ...................",
        "A1": "تشبع الألوان",
        "A2": "وضوح الخلفية",
        "A3": "الإضاءة وكمية الضوء",
        "A4": "زاوية التصوير",
        "a": 3,
        "Level": "I3MQ1",
        "isTF": false,
        "T":
            "الغالق هو المسؤول عن تحديد الوقت الذي يتعرض فيه المستشعر للضوء، مما يؤثر على سطوع الصورة."
      },
    ],
    2: [
      {
        "q":
            "الفرق الأساسي بين الغالق الميكانيكي والغالق الإلكتروني هو ..........................",
        "A1": "الغالق الميكانيكي أسرع من الإلكتروني",
        "A2": "الغالق الإلكتروني يعتمد على حركة فيزيائية",
        "A3": "الغالق الإلكتروني أكثر دقة وأسرع في التصوير المتتابع",
        "A4": "الغالق الميكانيكي يستخدم التيار الكهربائي فقط",
        "a": 3,
        "Level": "I3HQ1",
        "isTF": false,
        "T":
            "الغالق الإلكتروني يستخدم التيار الكهربائي فقط، وهو أسرع وأكثر دقة خاصة في التصوير السريع والمتتابع لأنه لا يعتمد على الحركة الفيزيائية (الحركة الفعلية)."
      },
      {
        "q":
            "تعكس العبارة .................. بشكل دقيق تأثير نوع الغالق (Shutter) على جودة الصورة في التصوير الفوتوغرافي.",
        "A1":
            "الغالق الميكانيكي يوفر دقة أعلى في التصوير المتتابع مقارنة بالغالق الإلكتروني.",
        "A2":
            "الغالق الإلكتروني يقلل من التشوهات الناتجة عن الحركة السريعة مقارنة بالغالق الميكانيكي.",
        "A3":
            "الغالق الإلكتروني أسرع وأكثر دقة، مما يجعله مناسبًا للتصوير المتتابع.",
        "A4":
            "الغالق الميكانيكي يعتمد على التيار الكهربائي فقط، مما يجعله أكثر كفاءة في الإضاءة المنخفضة.",
        "a": 3,
        "Level": "I3MQ2",
        "isTF": false,
        "T":
            "الغالق الإلكتروني يتميز بسرعته العالية وعدم اعتماده على الحركة الفيزيائية، مما يجعله أكثر دقة عند التقاط صور متتابعة بسرعة عالية. على العكس، الغالق الميكانيكي يعتمد على أجزاء متحركة، مما قد يجعله أبطأ نسبيًا. لهذا، يُفضَّل الغالق الإلكتروني في المواقف التي تتطلب تصويرًا سريعًا ودقيقًا، مثل تصوير الأحداث الرياضية أو التقاط صور متتابعة بدون تأخير."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير مشهد رياضي سريع الحركة وتحتاج إلى سرعة عالية لالتقاط الصور دون تشويش. أي نوع من أنواع الغالق سيكون الأنسب لهذا السيناريو؟",
        "A1": "الغالق الميكانيكي",
        "A2": "الغالق الإلكتروني",
        "A3": "الغالق الهجين",
        "A4": "لا فرق بين الغالقين",
        "a": 2,
        "Level": "I3HQ1",
        "isTF": false,
        "T":
            "الغالق الإلكتروني هو الخيار الأفضل عند التصوير السريع لأنّه يوفر سرعة أعلى ودقة أكبر، مما يجعله مثاليًا لتصوير الحركة السريعة مثل الرياضة."
      },
      {
        "q":
            "أنت في استوديو تصوير وتحتاج إلى الحصول على صورة ثابتة بدون أي اهتزازات أو تشويش. أي نوع من الغالق سيكون الأفضل هنا؟",
        "A1": "الغالق الميكانيكي",
        "A2": "الغالق الإلكتروني",
        "A3": "الغالق الهجين",
        "A4": "لا فرق بين الغالقين",
        "a": 1,
        "Level": "I3HQ2",
        "isTF": false,
        "T":
            "الغالق الميكانيكي مثالي لتصوير الصور الثابتة، حيث يتم تحريكه بشكل فيزيائي مما يقلل من التشويش الذي قد يحدث مع الغالق الإلكتروني في بعض الحالات."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "الوظيفة الرئيسية لمعين النظر (Viewfinder) في الكاميرا هي...............",
        "A1": "تحويل الضوء إلى إشارات كهربائية",
        "A2": "رؤية المشهد قبل التقاط الصورة",
        "A3": "تخزين الصور",
        "A4": "معالجة الإشارات",
        "a": 2,
        "Level": "I4EQ1",
        "isTF": false,
        "T":
            "معين النظر هو أداة تتيح للمصور رؤية المشهد وتحديد ما سيظهر في الصورة قبل التقاطها."
      },
      {
        "q": "يساعد معين النظر المصور على .....................",
        "A1": "تحويل الضوء إلى إشارات كهربائية",
        "A2": "رؤية المشهد قبل التقاط الصورة",
        "A3": "تخزين الصور",
        "A4": "معالجة الإشارات",
        "a": 2,
        "Level": "I4EQ2",
        "isTF": false,
        "T":
            "معين النظر هو أداة تتيح للمصور رؤية المشهد وتحديد ما سيظهر في الصورة قبل التقاطها."
      },
    ],
    2: [
      {
        "q":
            "يُعد المعين الإلكتروني أكثر فائدة من المعين البصري في حالة.................",
        "A1": "تصوير مشاهد سريعة الحركة",
        "A2": "ضبط الإضاءة في المشهد قبل التصوير",
        "A3": "التصوير في ضوء الشمس الساطع",
        "A4": "تصوير الفيديو",
        "a": 2,
        "Level": "I4MQ1",
        "isTF": false,
        "T":
            "المعين الإلكتروني يُظهر معاينة دقيقة للصورة الرقمية بما في ذلك الإضاءة وغيرها من التغييرات التي ستظهر في الصورة النهائية."
      },
      {
        "q":
            "الفرق الأساسي بين المعين البصري والمعين الإلكتروني هو ......................",
        "A1": "المعين الإلكتروني يعكس الصورة مباشرةً من العدسة",
        "A2": "المعين البصري يعرض صورة رقمية",
        "A3":
            "المعين الإلكتروني يُظهر صورة دقيقة لما ستبدو عليه الصورة النهائية",
        "A4": "المعين البصري يستخدم الطاقة الكهربائية",
        "a": 3,
        "Level": "I4MQ2",
        "isTF": false,
        "T":
            "المعين الإلكتروني (EVF) يعرض صورة رقمية دقيقة على الشاشة، مما يُظهر ما ستبدو عليه الصورة النهائية بدقة."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير منظر طبيعي في ضوء ساطع وتحتاج إلى التأكد من تفاصيل المشهد بشكل دقيق قبل التقاط الصورة. أي نوع من معين النظر سيكون الأنسب لهذا السيناريو؟",
        "A1": "المعين البصري",
        "A2": "المعين الإلكتروني (EVF)",
        "A3": "لا فرق بين المعينين",
        "A4": "المعينين كلاهما مناسب",
        "a": 2,
        "Level": "I4HQ1",
        "isTF": false,
        "T":
            "المعين الإلكتروني يعرض صورة رقمية دقيقة، مما يساعدك على رؤية تفاصيل الصورة بدقة في ظروف الإضاءة القوية، كما يمكن ضبط سطوع الصورة لتناسب الإضاءة الساطعة."
      },
      {
        "q":
            "أنت في جولة تصوير في الهواء الطلق وأنت بحاجة لرؤية المشهد بشكل طبيعي دون تشويش رقمي. أي نوع من معين النظر سيكون الأنسب لهذا الموقف؟",
        "A1": "المعين البصري",
        "A2": "المعين الإلكتروني (EVF)",
        "A3": "لا فرق بين المعينين",
        "A4": "المعينين كلاهما مناسب",
        "a": 1,
        "Level": "I4HQ2",
        "isTF": false,
        "T":
            "المعين البصري يعكس الصورة مباشرة من العدسة، مما يعرض لك المشهد كما هو دون تأثيرات رقمية، وهو مثالي للتصوير في الهواء الطلق حيث يكون التفاعل مع المشهد الطبيعي مهمًا."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "الوظيفة الرئيسية للشاشة الخلفية (LCD Screen) في الكاميرا هي .....................",
        "A1": "التقاط الصور",
        "A2": "عرض الصور والفيديوهات فور التقاطها",
        "A3": "تخزين الصور",
        "A4": "رؤية الصور قبل التقاطها",
        "a": 2,
        "Level": "I5EQ1",
        "isTF": false,
        "T":
            "الشاشة الخلفية تعرض ما تم التقاطه وتتيح التحكم في إعدادات الكاميرا."
      },
      {
        "q":
            "تتميز الشاشة الخلفية (LCD Screen) القابلة للإمالة أو اللمس في الكاميرا بقدرتها على ....................",
        "A1":
            "التحكم في زوايا التصوير وتوفر وضوحًا وسطوعًا في ظروف الإضاءة المختلفة",
        "A2": "تقليل حجم الصورة لزيادة التفاصيل الدقيقة",
        "A3": "تحسين أداء العدسة في الإضاءة المنخفضة",
        "A4": "تعديل سرعة الغالق تلقائيًا",
        "a": 1,
        "Level": "I5EQ2",
        "isTF": false,
        "T":
            "الشاشة الخلفية (LCD Screen) القابلة للإمالة أو اللمس تساعد في التحكم بسهولة في زوايا التصوير، كما توفر وضوحًا جيدًا وسطوعًا مناسبًا في ظروف الإضاءة المتنوعة."
      },
    ],
    2: [
      {
        "q":
            "تُحسن الشاشات الخلفية من تجربة التصوير الاحترافي من خلال ......................",
        "A1": "زيادة دقة الصور التي يتم التقاطها",
        "A2": "عرض إعدادات الكاميرا بشكل تفاعلي",
        "A3": "تحسين جودة الألوان في المشهد",
        "A4": "تقليل الحاجة إلى استخدام معين النظر",
        "a": 2,
        "Level": "I5MQ1",
        "isTF": false,
        "T": "الشاشة الخلفية تُظهر الإعدادات وتتيح تعديلها بسهولة."
      },
      {
        "q":
            "يمكن تحسين وضوح الشاشة الخلفية في ظروف الإضاءة الساطعة من خلال ......................",
        "A1": "استخدام غطاء عدسة خاص",
        "A2": "ضبط سطوع الشاشة",
        "A3": "تغيير العدسة المستخدمة",
        "A4": "تقليل جودة الصورة المعروضة",
        "a": 2,
        "Level": "I5MQ2",
        "isTF": false,
        "T":
            "ضبط سطوع ووضوح الشاشة يساعد على توفير تجربة مشاهدة جيدة في ظروف الإضاءة المختلفة."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير صورة في الخارج أثناء فترة غروب الشمس، حيث تكون الإضاءة خافتة. أي خاصية من خصائص الشاشة الخلفية ستكون الأكثر فائدة لضمان رؤية واضحة؟",
        "A1": "تحسين سطوع الشاشة",
        "A2": "استخدام الشاشة القابلة للإمالة",
        "A3": "التحكم في إعدادات الكاميرا عبر الشاشة",
        "A4": "لا شيء من الخيارات",
        "a": 1,
        "Level": "I5HQ1",
        "isTF": false,
        "T":
            "في ظروف الإضاءة الخافتة، تحسين سطوع الشاشة سيساعدك على ضبط الصورة بشكل صحيح وضمان رؤية التفاصيل بوضوح."
      },
      {
        "q":
            "أنت في رحلة تصوير وتحتاج إلى التقاط صور من زاوية صعبة أو منخفضة. أي ميزة من ميزات الشاشة الخلفية ستساعدك على تحقيق ذلك؟",
        "A1": "الشاشة القابلة للإمالة",
        "A2": "تحسين سطوع الشاشة",
        "A3": "التحكم في إعدادات الكاميرا عبر الشاشة",
        "A4": "الشاشة اللمسية",
        "a": 1,
        "Level": "I5HQ2",
        "isTF": false,
        "T":
            "الشاشة القابلة للإمالة تساعدك على رؤية الصورة بشكل مريح من زوايا غير تقليدية، مما يسهل التقاط الصور من مواقع صعبة."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "الوظيفة الرئيسية لوحدة التخزين في الكاميرا هي....................",
        "A1": "ضبط إعدادات الكاميرا",
        "A2": "تخزين الصور والفيديوهات",
        "A3": "إمداد الكاميرا بالطاقة اللازمة للعمل",
        "A4": "التحكم في زوايا التصوير",
        "a": 2,
        "Level": "I6EQ1",
        "isTF": false,
        "T":
            "وحدة التخزين في الكاميرا هي المسؤولة عن حفظ الصور والفيديوهات الملتقطة."
      },
      {
        "q": "تقوم بطاقة التخزين SD في الكاميرا الرقمية بـ .................",
        "A1": "تصغير حجم الصورة",
        "A2": "زيادة سرعة الكاميرا في التركيز",
        "A3": "تخزين الصور والفيديوهات بشكل فعال",
        "A4": "تحسين جودة العدسة",
        "a": 3,
        "Level": "I6EQ2",
        "isTF": false,
        "T":
            "بطاقة SD تقوم بتخزين الصور والفيديوهات الملتقطة وتُعد واحدة من الوسائط الأكثر فعالية."
      },
    ],
    2: [
      {
        "q":
            "أي من وسائط التخزين التالية يُستخدم بشكل شائع في الكاميرات الرقمية؟",
        "A1": "SD",
        "A2": "USB Flash",
        "A3": "External Hard Drive",
        "A4": "CD-Rom",
        "a": 1,
        "Level": "I6MQ1",
        "isTF": false,
        "T": "بطاقة SD هي واحدة من أشهر الوسائط المستخدمة في الكاميرات الرقمية."
      },
      {
        "q":
            "يؤثر / تؤثر .................... بشكل كبير على أداء بطاقة التخزين في الكاميرا.",
        "A1": "سعة البطاقة فقط",
        "A2": "سرعة القراءة والكتابة",
        "A3": "نوع الكاميرا المستخدمة",
        "A4": "نوع العدسة المتوافقة مع الكاميرا",
        "a": 2,
        "Level": "I6MQ2",
        "isTF": false,
        "T":
            "سرعة القراءة والكتابة تؤثر بشكل كبير على كيفية التعامل مع الصور والفيديوهات، خاصة في الكاميرات ذات الدقة العالية."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير فيديو عالي الجودة في حدث رياضي يستمر لساعات طويلة. أي نوع من وسائط التخزين سيكون الأنسب لهذا النوع من التصوير؟",
        "A1": "بطاقة SD ذات سعة صغيرة",
        "A2": "بطاقة CF ذات سرعة قراءة وكتابة عالية",
        "A3": "بطاقة Micro SD",
        "A4": "أي نوع من البطاقات لا يهم",
        "a": 2,
        "Level": "I6HQ1",
        "isTF": false,
        "T":
            "بطاقات CF تقدم سرعة قراءة وكتابة أعلى، مما يجعلها مثالية لتسجيل الفيديوهات عالية الجودة لفترات طويلة دون التأثير على الأداء."
      },
      {
        "q":
            "أنت في رحلة تصوير خارجية وتحتاج إلى تخزين مجموعة كبيرة من الصور عالية الدقة. أي نوع من بطاقات الذاكرة يجب عليك اختياره؟",
        "A1": "بطاقة Micro SD",
        "A2": "بطاقة SD عالية السعة",
        "A3": "بطاقة CF منخفضة السعة",
        "A4": "بطاقة SD منخفضة السرعة",
        "a": 2,
        "Level": "I6HQ2",
        "isTF": false,
        "T":
            "بطاقة SD ذات سعة عالية تتيح لك تخزين العديد من الصور عالية الدقة أثناء التصوير في المواقع الخارجية."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "الوظيفة الأساسية للمعالج في الكاميرا الرقمية هي ...................",
        "A1": "تحسين جودة العدسة",
        "A2": "معالجة الإشارات وتحويلها إلى ملفات رقمية",
        "A3": "تخزين الصور والفيديوهات",
        "A4": "ضبط إعدادات الإضاءة",
        "a": 2,
        "Level": "I7EQ1",
        "isTF": false,
        "T":
            "المعالج يعالج الإشارات التي تأتي من المستشعر ويحولها إلى ملفات رقمية مثل JPEG أو RAW."
      },
      {
        "q":
            "يُنتج المعالج ملفات .................. بعد معالجة الإشارات التي تأتي من المستشعر.",
        "A1": "صوتية",
        "A2": "رقمية للصور والفيديو",
        "A3": "صوتية وفيديو فقط",
        "A4": "نصية",
        "a": 2,
        "Level": "I7EQ2",
        "isTF": false,
        "T":
            "المعالج ينتج ملفات رقمية مثل الصور JPEG والفيديو RAW من الإشارات القادمة من المستشعر."
      },
    ],
    2: [
      {
        "q":
            "عند مقارنة معالج كاميرا رقمي متقدم مع معالج أساسي، ما هي الميزة الرئيسية التي توفرها المعالجات المتقدمة؟",
        "A1": "سرعة المعالجة",
        "A2": "تقليل استهلاك الطاقة",
        "A3": "تحسين جودة الصور في الإضاءة المنخفضة",
        "A4": "تحسين توازن الألوان وتقليل الضوضاء",
        "a": 4,
        "Level": "I7MQ1",
        "isTF": false,
        "T":
            "المعالجات المتقدمة ليست فقط أسرع، ولكنها تقدم ميزات إضافية مثل تحسين توازن الألوان وتقليل الضوضاء في الصور، مما يساهم في الحصول على صور عالية الجودة في ظروف إضاءة متنوعة."
      },
      {
        "q":
            "فيما يخص المعالج في الكاميرات الرقمية، أي من التالي يُعتبر من الخصائص التي قد تختلف بين المعالجات المتقدمة والمعالجات الأساسية؟",
        "A1": "سرعة الإغلاق التلقائي للكاميرا",
        "A2": "القدرة على تقليل الضوضاء في الإضاءة المنخفضة",
        "A3": "قدرة العدسة على التركيز التلقائي",
        "A4": "نوع العدسة المتوافقة مع الكاميرا",
        "a": 2,
        "Level": "I7MQ2",
        "isTF": false,
        "T":
            "المعالجات المتقدمة تقدم تقنيات متطورة مثل تقليل الضوضاء في الصور الملتقطة في الإضاءة المنخفضة، وهو ما يعزز جودة الصورة في ظروف التصوير غير المثالية."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير مشهد في ظروف إضاءة منخفضة وتحتاج إلى تقليل الضوضاء في الصورة. كيف يساعد المعالج في هذه الحالة؟",
        "A1": "باستخدام تقنية تحسين توازن الألوان فقط",
        "A2": "عن طريق ضغط البيانات بشكل أكبر",
        "A3": "عن طريق تقليل الضوضاء وتحسين التوازن اللوني",
        "A4": "عن طريق تقليل حجم الصورة فقط",
        "a": 3,
        "Level": "I7HQ1",
        "isTF": false,
        "T":
            "المعالج يقوم بتقليل الضوضاء وتحسين توازن الألوان في الصور التي تم التقاطها في ظروف إضاءة منخفضة أو عالية."
      },
      {
        "q":
            "في حالة تصوير صورة بتنسيق RAW، كيف يساهم المعالج في تحسين جودة الصورة؟",
        "A1": "يقوم بتقليل حجم الملف",
        "A2": "يعالج الصورة ويحسن التفاصيل دون فقدان الجودة",
        "A3": "يزيد من سرعة معالجة الصور",
        "A4": "يقوم بإضافة تأثيرات بصرية على الصورة",
        "a": 2,
        "Level": "I7HQ2",
        "isTF": false,
        "T":
            "تنسيق RAW يتطلب معالجة متقدمة من المعالج لتحسين التفاصيل دون فقدان الجودة أو التأثير على دقة الصورة."
      },
    ],
  },
  {
    1: [
      {
        "q": "الوظيفة الأساسية لمقبض الكاميرا هي ...............",
        "A1": "حفظ الصور والفيديوهات",
        "A2": "حمل الكاميرا بثبات",
        "A3": "التقاط الصور بسهولة",
        "A4": "معالجة البيانات من المستشعر",
        "a": 2,
        "Level": "I8EQ1",
        "isTF": false,
        "T":
            "مقبض الكاميرا يساعد في توفير ثبات أثناء التصوير وجعل عملية التقاط الصور أكثر راحة."
      },
      {
        "q": "يساعد زر التصوير في الكاميرا على ...................",
        "A1": "حفظ الصور والفيديوهات",
        "A2": "التقاط الصور بسهولة",
        "A3": "معالجة البيانات",
        "A4": "ضبط الإعدادات",
        "a": 2,
        "Level": "I8EQ2",
        "isTF": false,
        "T":
            "زر التصوير هو الأداة التي يستخدمها المصور لالتقاط الصور أو الفيديوهات."
      },
    ],
    2: [
      {
        "q":
            "تُعد المقابض المصممة خصيصًا مهمة في الكاميرات الاحترافية لأنها ....................",
        "A1": "تساعد في التقاط الصور بجودة أعلى",
        "A2": "تساهم في توفير راحة أثناء حمل الكاميرا لفترات طويلة",
        "A3": "تسرع من عملية معالجة الصور",
        "A4": "تقلل من سرعة الغالق",
        "a": 2,
        "Level": "I8MQ1",
        "isTF": false,
        "T":
            "المقابض المصممة خصيصًا توفر راحة أثناء حمل الكاميرا لفترات طويلة وتساعد في التصوير الثابت."
      },
      {
        "q":
            "إذا كان المقبض في الكاميرا غير مريح أثناء التصوير في ظروف غير مستقرة (مثل التصوير في الهواء الطلق)، التأثير المحتمل هو .......................",
        "A1": "تسريع عملية التركيز التلقائي",
        "A2": "زيادة احتمالية اهتزاز الصورة أو تشويشها",
        "A3": "زيادة حجم الصورة",
        "A4": "تحسين دقة الإضاءة",
        "a": 2,
        "Level": "I8MQ2",
        "isTF": false,
        "T":
            "في ظروف غير مستقرة، قد يؤدي المقبض غير المريح إلى زيادة الاهتزازات في الصورة."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير مشهد في وضع يدوي (manual mode) وتلاحظ أن الصورة تظهر مشوشة. ما هو الدور الذي يمكن أن يلعبه مقبض الكاميرا في تحسين النتيجة؟",
        "A1":
            "يوفر استقرارًا أفضل ويحسن قبضتك على الكاميرا لتجنب الاهتزاز أثناء التصوير",
        "A2": "يساعد في ضبط الإعدادات التلقائية بشكل أفضل",
        "A3": "يعزز من جودة الصورة بزيادة السرعة",
        "A4": "يعزز من السطوع في الصورة",
        "a": 1,
        "Level": "I8HQ1",
        "isTF": false,
        "T":
            "مقبض الكاميرا مصمم لتحسين قبضتك وثبات الكاميرا، مما يقلل من الاهتزازات التي قد تؤدي إلى تشويش الصورة."
      },
      {
        "q":
            "أنت تستخدم الكاميرا في ظروف التصوير السريعة وتحتاج إلى التقاط صور متتالية بسرعة. كيف يساعدك زر التصوير في هذه الحالة؟",
        "A1": "يتيح لك التقاط الصور بسرعة أكبر بشكل تلقائي",
        "A2": "يسمح بالتقاط الصور بدقة عالية حتى في وضع التسارع",
        "A3": "يتيح لك اختيار نوع العدسة بشكل أسرع",
        "A4": "يوفر لك خيارات تعدد الإضاءة في الصورة",
        "a": 1,
        "Level": "I8HQ2",
        "isTF": false,
        "T":
            "زر التصوير مصمم لتسهيل التقاط الصور بسرعة، خاصة في أوضاع مثل التصوير المتتابع، مما يساعد في التقاط صور متعددة في فترة قصيرة."
      },
    ],
  },
  {
    1: [
      {
        "q": "الوظيفة الأساسية للبطارية في الكاميرا هي ......................",
        "A1": "معالجة البيانات",
        "A2": "إمداد الكاميرا بالطاقة اللازمة للعمل",
        "A3": "تخزين الصور والفيديوهات",
        "A4": "تعديل إعدادات الكاميرا",
        "a": 2,
        "Level": "I9EQ1",
        "isTF": false,
        "T":
            "البطارية تمد الكاميرا بالطاقة اللازمة لتشغيل الأجزاء المختلفة مثل المستشعر والعدسة."
      },
      {
        "q": "تستخدم الكاميرات الحديثة بطاريات من النوع .....................",
        "A1": "النيكل-كادميوم",
        "A2": "ليثيوم-أيون",
        "A3": "الزنك-كربون",
        "A4": "هيدريد المعدن",
        "a": 2,
        "Level": "I9EQ2",
        "isTF": false,
        "T":
            "الكاميرات الحديثة تعتمد على بطاريات ليثيوم-أيون لأنها توفر طاقة أكبر ومدة عمل أطول."
      },
    ],
    2: [
      {
        "q":
            "الفرق الرئيسي بين بطاريات ليثيوم-أيون والبطاريات الأخرى في الكاميرات الرقمية هو.....................",
        "A1": "بطاريات ليثيوم-أيون توفر طاقة أكبر ومدة عمل أطول",
        "A2": "بطاريات ليثيوم-أيون أقل تكلفة",
        "A3": "بطاريات ليثيوم-أيون ليست قابلة لإعادة الشحن",
        "A4": "بطاريات ليثيوم-أيون تستهلك طاقة أكثر",
        "a": 1,
        "Level": "I9MQ1",
        "isTF": false,
        "T":
            "بطاريات ليثيوم-أيون تقدم طاقة أعلى ومدة عمل أطول مقارنة بالأنواع الأخرى، مما يجعلها الخيار المثالي للكاميرات الحديثة التي تتطلب أداء عاليًا."
      },
      {
        "q":
            "في الكاميرات الرقمية، يتم استخدام بطاريات ليثيوم-أيون بشكل شائع لأنها.....................",
        "A1": "أخف وزنًا مقارنة بالبطاريات الأخرى",
        "A2": "توفر طاقة أكثر وتحسن من عمر البطارية",
        "A3": "تستهلك طاقة أقل من البطاريات الأخرى",
        "A4": "يمكن استبدالها بسهولة",
        "a": 2,
        "Level": "I9MQ2",
        "isTF": false,
        "T":
            "بطاريات ليثيوم-أيون توفر طاقة أكبر مما يتيح عمر أطول للبطارية، مما يجعلها الخيار الأكثر شيوعًا في الأجهزة التي تحتاج إلى طاقة كبيرة مثل الكاميرات الرقمية."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير حدث طويل الأمد وتحتاج إلى طاقة مستمرة. ما هي ميزة بطاريات ليثيوم-أيون مقارنة بالبطاريات القديمة التي قد تكون مفيدة في هذا السياق؟",
        "A1": "يمكن شحنها بسرعة أكبر",
        "A2": "توفر طاقة أكبر وتحسن عمر البطارية في ظروف الاستخدام المستمر",
        "A3": "تستهلك طاقة بشكل أسرع",
        "A4": "يمكن استخدامها في أي نوع من الكاميرات دون القلق",
        "a": 2,
        "Level": "I9HQ1",
        "isTF": false,
        "T":
            "بطاريات ليثيوم-أيون تقدم أداء جيدًا في التصوير المستمر وتقلل من الحاجة لإعادة الشحن المتكرر."
      },
      {
        "q":
            "أنت في جلسة تصوير في بيئة خارجية حيث لا يتوفر شحن مستمر. كيف يمكن لبطارية ليثيوم-أيون أن تساعدك مقارنة بالبطاريات الأخرى؟",
        "A1": "تتيح لك تصوير لعدة ساعات دون الحاجة لتغيير البطارية",
        "A2": "تعطي شحنة واحدة تكفي فقط لبضع دقائق من التصوير",
        "A3": "تتوقف عن العمل بسرعة عندما تكون درجة الحرارة منخفضة",
        "A4": "تجعل الكاميرا تعمل بسرعة أكبر",
        "a": 1,
        "Level": "I9HQ2",
        "isTF": false,
        "T":
            "بطاريات ليثيوم-أيون توفر مدة عمل أطول، مما يتيح لك الاستمرار في التصوير لفترات طويلة دون الحاجة إلى إعادة الشحن أو التغيير المتكرر للبطارية."
      },
    ],
  },
];

// {
//     1: [
//       {
//         "q": "",
//         "A1": "",
//         "A2": "",
//         "A3": "",
//         "A4": "",
//         "a": 2,
//         "Level": "I1EQ1",
//         "isTF": false,
//         "T": "",
//       },
//       {
//         "q": "",
//         "A1": "",
//         "A2": "",
//         "A3": "",
//         "A4": "",
//         "a": 2,
//         "Level": "I2EQ2",
//         "isTF": false,
//         "T": "",
//       },
//     ],
//     2: [
//       {
//         "q": "",
//         "A1": "",
//         "A2": "",
//         "A3": "",
//         "A4": "",
//         "a": 2,
//         "Level": "I1MQ1",
//         "isTF": false,
//         "T": "",
//       },
//       {
//         "q": "",
//         "A1": "",
//         "A2": "",
//         "A3": "",
//         "A4": "",
//         "a": 2,
//         "Level": "I1MQ2",
//         "isTF": false,
//         "T": "",
//       },
//     ],
//     3: [
//       {
//         "q": "",
//         "A1": "",
//         "A2": "",
//         "A3": "",
//         "A4": "",
//         "a": 2,
//         "Level": "I1HQ1",
//         "isTF": false,
//         "T": "",
//       },
//       {
//         "q": "",
//         "A1": "",
//         "A2": "",
//         "A3": "",
//         "A4": "",
//         "a": 2,
//         "Level": "I1HQ2",
//         "isTF": false,
//         "T": "",
//       },
//     ],
//   },
