List<Map<int, dynamic>> secondExamQuestions = [
  {
    1: [
      {
        "q": "البكسل هو ................",
        "A1": "برنامج لتحرير الصور",
        "A2": "أصغر وحدة للصورة الرقمية",
        "A3": "جهاز لتخزين الصور",
        "A4": "أداة لتكبير الصور",
        "a": 2,
        "Level": "I1EQ1",
        "isTF": false,
        "T":
            "البكسل هو أصغر وحدة للصورة الرقمية فهو المكون الأساسي لأي صورة رقمية، حيث يتم تجميع ملايين البكسلات لتكوين الصورة الكاملة.",
      },
      {
        "q": "يتم قياس دقة الصورة الرقمية بوحدة..............",
        "A1": "الميغابكسل",
        "A2": "الفريم في الثانية",
        "A3": "الأوم",
        "A4": "الواط",
        "a": 1,
        "Level": "I1EQ2",
        "isTF": false,
        "T":
            "يتم قياس دقة الصورة الرقمية بعدد الميغابكسل (MP)، حيث يشير هذا الرقم إلى عدد الملايين من البكسلات التي تشكل الصورة.",
      },
    ],
    2: [
      {
        "q": "عند زيادة عدد الميغابكسل في الكاميرا ..........",
        "A1": "تزداد دقة الصورة وتحسن التفاصيل",
        "A2": "تصبح الصور أكثر قتامة",
        "A3": "يقل حجم الصورة عند التخزين",
        "A4": "تقل جودة الألوان",
        "a": 1,
        "Level": "I1MQ1",
        "isTF": false,
        "T":
            "عدد الميغابكسل الأعلى يعني أن الصورة تحتوي على عدد أكبر من البكسلات، مما يسمح بالتقاط تفاصيل أكثر دقة، خاصة عند التكبير أو الطباعة بجودة عالية.",
      },
      {
        "q":
            "العلاقة بين عدد الميغابكسل وجودة التفاصيل في الصورة هي ................",
        "A1": "لا توجد علاقة بينهما",
        "A2": "كلما زاد عدد الميغابكسل، زادت القدرة على التقاط تفاصيل أدق",
        "A3": "الكاميرات ذات عدد ميغابكسل أقل تعطي تفاصيل أوضح",
        "A4": "يعتمد الأمر فقط على جودة العدسة وليس على عدد الميغابكسل",
        "a": 2,
        "Level": "I1MQ2",
        "isTF": false,
        "T":
            "عدد الميغابكسل يؤثر على دقة التفاصيل، حيث أن زيادة البكسلات تعني وجود نقاط أكثر تشكل الصورة، مما يساعد على وضوح التفاصيل عند التكبير أو الطباعة بحجم كبير.",
      },
    ],
    3: [
      {
        "q":
            "إذا كنت ترغب في التقاط صور واضحة للطباعة بحجم كبير، أي دقة يفضل اختيارها؟",
        "A1": "دقة منخفضة (5 ميغابكسل أو أقل)",
        "A2": "دقة متوسطة (8-12 ميغابكسل)",
        "A3": "دقة عالية (20 ميغابكسل أو أكثر)",
        "A4": "لا فرق بين أي دقة",
        "a": 3,
        "Level": "I1HQ1",
        "isTF": false,
        "T":
            "للحصول على صور ذات جودة عالية عند الطباعة بحجم كبير، من الأفضل استخدام كاميرا ذات دقة مرتفعة لضمان الاحتفاظ بجميع التفاصيل دون فقدان الوضوح عند التكبير.",
      },
      {
        "q":
            "إذا كنت ترغب في التقاط صورة لمنظر طبيعي بتفاصيل دقيقة ليتم طباعته على لوحة كبيرة، أي كاميرا يفضل اختيارها؟",
        "A1": "كاميرا بدقة 5 ميغابكسل",
        "A2": "كاميرا بدقة 12 ميغابكسل",
        "A3": "كاميرا بدقة 24 ميغابكسل أو أعلى",
        "A4": "أي كاميرا متاحة لأن عدد الميغابكسل لا يؤثر على التفاصيل",
        "a": 3,
        "Level": "I1HQ2",
        "isTF": false,
        "T":
            "عند طباعة الصور بحجم كبير، يُفضل استخدام كاميرا ذات عدد ميغابكسل مرتفع للحفاظ على التفاصيل الدقيقة ومنع تشوش الصورة عند التكبير.",
      },
    ],
  },
  {
    1: [
      {
        "q": "الدور الأساسي لفتحة العدسة في التصوير هو ..............",
        "A1": "تغيير زاوية التصوير",
        "A2": "التحكم في كمية الضوء الداخل إلى المستشعر",
        "A3": "ضبط سرعة الغالق",
        "A4": "تقليل دقة الصورة",
        "a": 2,
        "Level": "I2EQ1",
        "isTF": false,
        "T":
            "فتحة العدسة تحدد مقدار الضوء الذي يصل إلى المستشعر، مما يؤثر على سطوع الصورة.",
      },
      {
        "q": "تعد .......... فتحة عدسة واسعة.",
        "A1": "f/1.4",
        "A2": "f/8",
        "A3": "f/16",
        "A4": "f/22",
        "a": 1,
        "Level": "I2EQ2",
        "isTF": false,
        "T":
            "القيم الأصغر مثل f/1.4 تشير إلى فتحة عدسة واسعة تسمح بدخول كمية أكبر من الضوء، مما يساعد في التصوير في الإضاءة المنخفضة.",
      },
    ],
    2: [
      {
        "q": "استخدام فتحة عدسة ضيقة مثل  f/22يساعد على ...............",
        "A1": "زيادة تشوش الخلفية",
        "A2": "تقليل كمية الضوء الداخل وتحقيق وضوح أكبر في الصورة",
        "A3": "جعل الصورة أكثر سطوعًا",
        "A4": "تحسين سرعة الغالق تلقائيًا",
        "a": 2,
        "Level": "I2MQ1",
        "isTF": false,
        "T":
            "فتحة عدسة ضيقة مثل f/22 تقلل الضوء الداخل، لكنها تزيد عمق المجال، مما يجعل كل عناصر الصورة أكثر وضوحًا، وهو مناسب لتصوير المناظر الطبيعية.",
      },
      {
        "q":
            "أي من العبارات الآتية توضح تأثير فتحة العدسة على الصورة الملتقطة؟",
        "A1":
            "تتحكم فتحة العدسة في كمية الضوء الداخل إلى المستشعر فقط دون التأثير على الخلفية.",
        "A2":
            "كلما كانت الفتحة واسعة مثل  f/1.4، زاد دخول الضوء وأصبحت الخلفية ضبابية.",
        "A3":
            "كلما كانت الفتحة ضيقة مثل f/22، زاد دخول الضوء وأصبحت الخلفية ضبابية.",
        "A4":
            "لا تؤثر فتحة العدسة على جودة الصورة، بل تؤثر فقط على سرعة الغالق.",
        "a": 2,
        "Level": "I2MQ2",
        "isTF": false,
        "T":
            "الفتحات الواسعة مثل f/1.4 تسمح بدخول مزيد من الضوء إلى المستشعر، مما يقلل عمق المجال ويجعل الخلفية غير واضحة، وهو مناسب لتصوير البورتريه.",
      },
    ],
    3: [
      {
        "q":
            "إذا كنت تريد تصوير بورتريه لشخص مع خلفية ضبابية، يتم اختيار فتحة عدسة...............",
        "A1": "f/2.8",
        "A2": "f/11",
        "A3": "f/16",
        "A4": "f/22",
        "a": 1,
        "Level": "I2HQ1",
        "isTF": false,
        "T":
            "استخدام فتحة عدسة واسعة مثل f/2.8 يسمح بدخول المزيد من الضوء ويقلل عمق المجال، مما يؤدي إلى تشويش الخلفية وجعل الشخص بارزًا في الصورة لذلك فهي مناسبة لتصوير البورتريه بخلفية ضبابية.",
      },
      {
        "q":
            "إذا كنت تصور مشهدًا طبيعيًا وترغب في جعل كل العناصر واضحة من المقدمة إلى الخلفية، يتم اختيار فتحة عدسة.................",
        "A1": "f/1.8",
        "A2": "f/4",
        "A3": "f/8",
        "A4": "f/16",
        "a": 4,
        "Level": "I2HQ2",
        "isTF": false,
        "T":
            "استخدام فتحة عدسة ضيقة مثل f/16 يساعد في زيادة عمق المجال، مما يجعل جميع عناصر المشهد واضحة، وهو مثالي لتصوير المناظر الطبيعية.",
      },
    ],
  },
  {
    1: [
      {
        "q": "عند تصوير ............... يتم استخدام سرعة غالق بطيئة مثل 1/30.",
        "A1": "حركة سريعة مثل كرة قدم",
        "A2": "مشهد ثابت في إضاءة جيدة",
        "A3": "مشهد مائي مع تأثير ضبابي",
        "A4": "شخص في حالة حركة",
        "a": 3,
        "Level": "I3EQ1",
        "isTF": false,
        "T":
            "سرعة الغالق البطيئة تسمح بدخول الضوء لفترة أطول، مما يمكن أن يخلق تأثيرات ضبابية في تصوير حركة الماء أو السماء.",
      },
      {
        "q": "سرعة الغالق العالية مثل 1/1000 تساعد على ..................",
        "A1": "دخول الضوء لفترة طويلة",
        "A2": "التقاط الحركة السريعة بوضوح",
        "A3": "خلق تأثير ضبابي في الصورة",
        "A4": "التقاط الحركة البطيئة",
        "a": 2,
        "Level": "I3EQ2",
        "isTF": false,
        "T":
            "سرعة غالق عالية مثل 1/1000 تساعد على تجميد الحركة السريعة، مثل في تصوير الرياضات السريعة أو الطيور أثناء الطيران.",
      },
    ],
    2: [
      {
        "q":
            "أي من العبارات الآتية توضح تأثير سرعة الغالق (Shutter Speed) على الصورة الفوتوغرافية؟",
        "A1":
            "سرعة الغالق العالية (1/1000) تُستخدم لإظهار تأثيرات ضبابية في الصور.",
        "A2":
            "سرعة الغالق المنخفضة (1/30) تساعد في تجميد الحركة في اللقطات الرياضية.",
        "A3":
            "سرعة الغالق العالية تسمح بالتقاط تفاصيل الأجسام المتحركة دون ضبابية.",
        "A4": "سرعة الغالق ليس لها تأثير على كمية الضوء الداخلة إلى المستشعر.",
        "a": 3,
        "Level": "I3MQ1",
        "isTF": false,
        "T":
            "سرعة الغالق تتحكم في مدة تعرض المستشعر للضوء، مما يؤثر على وضوح الأجسام المتحركة. عند استخدام سرعة غالق عالية مثل 1/1000، يتم تجميد الحركة بوضوح، وهو مثالي لتصوير الرياضة والحركة السريعة. أما سرعة الغالق المنخفضة مثل 1/30، فتسمح بمرور الضوء لفترة أطول، مما يؤدي إلى تأثيرات ضبابية رائعة، كما هو الحال عند تصوير تدفق المياه أو حركة النجوم.",
      },
      {
        "q":
            "إذا تم استخدام سرعة غالق بطيئة جدًا مثل ½ فإن الصورة ستكون.................",
        "A1": "ضبابية",
        "A2": "حادة وواضحة",
        "A3": "مظلمة جدًا",
        "A4": "مشرقة جدًا",
        "a": 1,
        "Level": "I3MQ2",
        "isTF": false,
        "T":
            "استخدام سرعة غالق بطيئة جدًا مثل 1/2 يمكن أن يؤدي إلى ضبابية الصورة بسبب السماح للضوء بالدخول لفترة أطول، وهو مفيد لإنشاء تأثيرات ضبابية مثل تصوير تدفق المياه.",
      },
    ],
    3: [
      {
        "q":
            "إذا كنت تقوم بتصوير مشهد رياضي حيث اللاعبين في حركة سريعة. للحصول على صورة واضحة بدون تشويش يجب أن تكون سرعة الغالق ..............",
        "A1": "1/30",
        "A2": "1/250",
        "A3": "1/1000",
        "A4": "1/500",
        "a": 3,
        "Level": "I3HQ1",
        "isTF": false,
        "T":
            "سرعة الغالق العالية مثل 1/1000 تجمّد الحركة السريعة بشكل فعال وتقلل من التشويش، مما يجعلها مثالية لتصوير الأنشطة الرياضية مثل سباقات الجري أو كرة القدم.",
      },
      {
        "q":
            "إذا كنت في موقع تصوير ليلي لمدينة مضيئة وترغب في التقاط صورة تظهر حركة المرور كخطوط ضوء مستمرة. يجب اختيار سرعة غالق.................",
        "A1": "1/30",
        "A2": "1/500",
        "A3": "1/1000",
        "A4": "1/2000",
        "a": 1,
        "Level": "I3HQ2",
        "isTF": false,
        "T":
            "سرعة الغالق البطيئة مثل 1/30 تسمح بدخول الضوء لفترة أطول، مما يؤدي إلى ظهور خطوط ضوء من السيارات المتحركة وتسجيل الحركة بشكل سلس، وهو ما يناسب التصوير الليلي لحركة المرور.",
      },
    ],
  },
  {
    1: [
      {
        "q": "قيمة ISO في الكاميرا تعني................",
        "A1": "1.تحديد سرعة الغالق",
        "A2": "2.مدى استجابة الكاميرا للإضاءة",
        "A3": "3.ضبط توازن الألوان في الصورة",
        "A4": "تغيير زاوية التصوير",
        "a": 2,
        "Level": "I4EQ1",
        "isTF": false,
        "T": "ISO يحدد مدى استجابة المستشعر للضوء.",
      },
      {
        "q":
            "عند التصوير في بيئة ذات إضاءة منخفضة، يتم اختيار القيمة ................ لحساسية الضوء (ISO).",
        "A1": "ISO 100",
        "A2": "ISO 200",
        "A3": "ISO 800",
        "A4": "ISO 3200",
        "a": 4,
        "Level": "I4EQ2",
        "isTF": false,
        "T":
            "كلما زادت قيمة ISO، أصبحت الكاميرا أكثر حساسية للضوء، مما يسمح بالتقاط صور أكثر إشراقًا في البيئات المظلمة.",
      },
    ],
    2: [
      {
        "q":
            "عند التصوير في إضاءة ضعيفة باستخدام  ISO 3200، ما الذي يمكن أن يحدث للصورة مقارنة باستخدام  ISO 100؟",
        "A1": "ستكون الصورة أكثر وضوحًا وأقل تشويشًا",
        "A2": "ستكون الصورة أكثر سطوعًا ولكن مع احتمال ظهور تشويش",
        "A3": "ستكون الصورة أغمق مع تفاصيل أقل وضوحًا",
        "A4": "لن يكون هناك فرق واضح بين القيمتين",
        "a": 2,
        "Level": "I4MQ1",
        "isTF": false,
        "T":
            "كلما زادت قيمة  ISO، أصبحت الكاميرا أكثر حساسية للضوء، مما يجعل الصورة أكثر سطوعًا في الإضاءة المنخفضة. لكن القيم العالية مثل ISO 3200 قد تسبب زيادة في التشويش، مما يقلل من جودة الصورة مقارنة بـ ISO 100، الذي يوفر صورة أوضح لكنه يحتاج إلى إضاءة قوية للحصول على نتائج جيدة.",
      },
      {
        "q":
            "رفع قيمة ISO إلى 3200 عند التصوير في بيئة ذات إضاءة ضعيفة يؤدي إلى..................",
        "A1": "زيادة سطوع الصورة ولكن قد يؤدي إلى ظهور تشويش",
        "A2": "تقليل سطوع الصورة ولكن يحسن التفاصيل",
        "A3": "زيادة وضوح التفاصيل ويقلل التشويش",
        "A4": "التقاط الصورة كما هي بسطوعها وتفاصيلها",
        "a": 1,
        "Level": "I4MQ2",
        "isTF": false,
        "T":
            "رفع ISO يزيد من حساسية المستشعر للضوء، مما يجعل الصورة أكثر سطوعًا في الإضاءة الضعيفة. ومع ذلك، زيادة ISO إلى قيم عالية مثل 3200 قد يؤدي إلى ظهور تشويش في الصورة، مما يحد من وضوح التفاصيل وجودة الصورة بشكل عام.",
      },
    ],
    3: [
      {
        "q":
            "إذا كنت تصور في بيئة ذات إضاءة ضعيفة وتستخدم قيمة ISO 3200 على الرغم من أن الصورة تبدو مشرقة، إلا أن هناك بعض التشويش غير المرغوب فيه. كيف يمكنك تحسين الصورة دون فقدان سطوعها؟",
        "A1": "خفض ISO إلى 100 وزيادة سرعة الغالق بشكل كبير",
        "A2": "زيادة ISO إلى 6400 لتقليل التشويش وتحسين السطوع",
        "A3": "خفض ISO إلى 1600 مع زيادة فتحة العدسة أو تقليل سرعة الغالق",
        "A4": "الحفاظ على ISO 3200 مع زيادة سرعة الغالق بشكل كبير",
        "a": 3,
        "Level": "I4HQ1",
        "isTF": false,
        "T":
            "خفض ISO يقلل التشويش في الصورة، بينما زيادة فتحة العدسة أو تقليل سرعة الغالق يساعدان في تعويض نقص الإضاءة. باستخدام  ISO 1600، يمكنك الحصول على صورة أقل تشويشًا مع الحفاظ على السطوع المناسب دون الحاجة إلى رفع ISO إلى مستويات قد تؤدي إلى تشويش أكثر.",
      },
      {
        "q":
            "إذا كنت تصور في بيئة ذات إضاءة قوية (مثلاً في وضح النهار) وتستخدم ISO 3200 على الرغم من أن الصورة تبدو مشبعة بالإضاءة، إلا أن التفاصيل تظهر ضبابية وغير واضحة. ما الإجراء الأفضل لتحسين الصورة؟",
        "A1": "تقليل ISO إلى 100 مع تقليل سرعة الغالق لتقليل التشويش",
        "A2": "رفع ISO إلى 6400 لتزيد من حساسية الكاميرا وتقلل الضبابية",
        "A3":
            "تقليل ISO إلى 100 مع زيادة سرعة الغالق لتقليل الإضاءة الزائدة وضبط التفاصيل",
        "A4": "تقليل ISO إلى 400 وزيادة فتحة العدسة بشكل كبير لتحسين الوضوح",
        "a": 3,
        "Level": "I4HQ2",
        "isTF": false,
        "T":
            "في الإضاءة القوية، يؤدي استخدام ISO مرتفع مثل 3200 إلى زيادة سطوع الصورة بشكل زائد مما قد يتسبب في فقدان التفاصيل. لتصحيح ذلك، يمكن تقليل ISO إلى 100 لتقليل الإضاءة الزائدة، مع زيادة سرعة الغالق لتجنب تعريض الصورة بشكل مفرط وتحسين وضوح التفاصيل.",
      },
    ],
  },
  {
    1: [
      {
        "q":
            "الوظيفة الأساسية لـ 'توازن اللون الأبيض (White Balance)' في التصوير الفوتوغرافي هي...............",
        "A1": "تغيير السطوع في الصورة",
        "A2": "ضمان توافق ألوان الصورة مع مصادر الإضاءة المختلفة",
        "A3": "تحسين وضوح الصورة في الإضاءة الضعيفة",
        "A4": "تقليل التشويش في الصورة",
        "a": 2,
        "Level": "I5EQ1",
        "isTF": false,
        "T":
            "توازن اللون الأبيض (White Balance) يعمل على تعديل الألوان في الصورة لتظهر بشكل طبيعي بغض النظر عن نوع الإضاءة. مثلاً، في الإضاءة الاصطناعية قد تميل الصورة إلى اللون الأصفر، بينما في ضوء الشمس قد تكون الصورة أكثر برودة. توازن اللون الأبيض يضبط ذلك لتظهر الألوان كما هي في الواقع.",
      },
      {
        "q":
            "الإعداد الذي يجب تعديله لتحسين الألوان في الصورة هو ....................",
        "A1": "زيادة ISO",
        "A2": "تعديل توازن اللون الأبيض",
        "A3": "تقليل سرعة الغالق",
        "A4": "تقليل فتحة العدسة",
        "a": 2,
        "Level": "I5EQ2",
        "isTF": false,
        "T":
            "يجب تعديل إعداد توازن اللون الأبيض لضبط الألوان في الصورة وجعلها أكثر طبيعية، مما يمنع التشوهات الناتجة عن نوع الإضاءة. فمثلًا في الإضاءة الاصطناعية مثل المصابيح الكهربائية، قد تميل الألوان إلى الدفء (الأصفر). لتصحيح ذلك، يجب تعديل توازن اللون الأبيض لتظهر الألوان كما هي في الواقع.",
      },
    ],
    2: [
      {
        "q":
            "اختيار إعدادات توازن اللون الأبيض غير الصحيحة على الصورة عند التصوير في بيئة تحتوي على مصادر إضاءة مختلطة يؤدي إلى..................",
        "A1": "تشويش الصورة ويجعل التفاصيل غير واضحة",
        "A2": "انحراف الألوان في الصورة ويجعل الألوان تبدو غير طبيعية",
        "A3": "زيادة سطوع الصورة وتحسين تفاصيل الظلال",
        "A4": "تحسين تباين الصورة وتقليل التشويش",
        "a": 2,
        "Level": "I5MQ1",
        "isTF": false,
        "T":
            "عند التصوير في بيئة تحتوي على مصادر إضاءة مختلطة (مثل الضوء الطبيعي والضوء الاصطناعي)، إذا لم يتم ضبط توازن اللون الأبيض بشكل صحيح، ستظهر الألوان في الصورة غير طبيعية. قد تميل الصورة إلى اللون الأزرق أو الأصفر أو حتى الأخضر، مما يؤثر على دقة الألوان وواقعية الصورة.",
      },
      {
        "q":
            "ضبط  توازن اللون الأبيض بشكل صحيح في إضاءة غير متجانسة يؤدي إلى.................",
        "A1": "تحسين دقة الألوان وضمان ظهورها بشكل طبيعي",
        "A2": "تغير كبير في الإضاءة وظهور الصورة داكنة",
        "A3": "تقليل التشويش فقط دون التأثير على الألوان",
        "A4": "زيادة سطوع الصورة دون تغيير في الألوان",
        "a": 1,
        "Level": "I5MQ2",
        "isTF": false,
        "T":
            "ضبط توازن اللون الأبيض بشكل صحيح يساعد على معالجة تأثيرات الإضاءة المختلفة في المشهد، مما يضمن ظهور الألوان بشكل طبيعي وصحيح. هذا التعديل يقلل من تأثيرات الألوان غير المرغوب فيها، مثل ميل الصورة إلى اللون الأزرق أو الأصفر.",
      },
    ],
    3: [
      {
        "q":
            "إذا كنت تقوم بتصوير مشهد في بيئة تحتوي على خليط من ضوء الشمس والإضاءة الاصطناعية باستخدام إعدادات توازن اللون الأبيض التلقائي. بعد مراجعة الصورة، لاحظت أن الألوان تظهر غير طبيعية، وتميل إلى اللون الأصفر. ما هو أفضل إجراء لتصحيح الألوان في هذه الصورة؟",
        "A1": "ترك إعداد توازن اللون الأبيض التلقائي كما هو",
        "A2":
            "ضبط توازن اللون الأبيض يدويًا لتحديد درجة الحرارة اللونية المناسبة",
        "A3": "زيادة ISO لضبط الإضاءة بشكل أفضل",
        "A4": "تقليل سرعة الغالق لزيادة الضوء في الصورة",
        "a": 2,
        "Level": "I5HQ1",
        "isTF": false,
        "T":
            "عند وجود خليط من الضوء الطبيعي والاصطناعي، قد لا يكون توازن اللون الأبيض التلقائي دقيقًا. لضمان ألوان دقيقة وطبيعية، يجب ضبط توازن اللون الأبيض يدويًا وفقًا للنوع المحدد من الإضاءة (مثل ضوء الشمس والإضاءة الاصطناعية) للحصول على توازن لوني أفضل.",
      },
      {
        "q":
            "أنت تقوم بتصوير مشهد تحت إضاءة مختلطة تحتوي على ضوء الشمس والضوء الدافئ من مصابيح كهربائية. ماذا سيحدث إذا قمت بضبط توازن اللون الأبيض على 'ضوء الشمس'؟",
        "A1":
            "ستصبح الصورة مائلة إلى اللون الأصفر نتيجة ضوء المصابيح الكهربائية",
        "A2": "ستظهر الصورة بألوان دقيقة ومتناسقة",
        "A3": "ستظهر الصورة مائلة إلى اللون الأزرق نتيجة تعارض الإضاءة",
        "A4": "ستتغير الصورة لتصبح أكثر سطوعًا وتفاصيلها أوضح",
        "a": 1,
        "Level": "I5HQ2",
        "isTF": false,
        "T":
            "إعداد 'ضوء الشمس' مخصص للتصوير تحت ضوء الشمس الطبيعي. عند استخدامه في بيئة تحتوي على ضوء دافئ من المصابيح الكهربائية، سيؤدي ذلك إلى اختلال في توازن الألوان، حيث ستصبح الصورة مائلة إلى اللون الأصفر بسبب تداخل الضوء الدافئ مع الإعداد الخاص بضوء الشمس.",
      },
    ],
  },
];
