List<Map<int, dynamic>> thirdExamQuestions = [
  {
    1: [
      {
        "q":
            "الميزة الرئيسية للعدسات ذات الطول البؤري الثابت (Prime Lenses) هي......................",
        "A1": "إمكانية تغيير الطول البؤري حسب الحاجة",
        "A2": "عدد العناصر البصرية الداخلية أقل مما يسهم في تحسين جودة الصورة",
        "A3": "توفر زاوية رؤية واسعة",
        "A4": "تعمل بشكل جيد في الإضاءة المنخفضة فقط",
        "a": 2,
        "Level": "I1EQ1",
        "isTF": false,
        "T":
            "الإجابة صحيحة: العدسات ذات الطول البؤري الثابت تحتوي على عدد أقل من العناصر البصرية الداخلية مما يساعد في تحسين جودة الصورة وزيادة الوضوح."
      },
      {
        "q":
            "تستخدم العدسات ذات الطول البؤري الثابت بشكل أفضل في تصوير...................",
        "A1": "المناظر الطبيعية بزاوية رؤية واسعة",
        "A2": "البورتريه",
        "A3": "الحركة السريعة",
        "A4": "الفيديو بزاوية مشاهدة ثابتة",
        "a": 2,
        "Level": "I1EQ2",
        "isTF": false,
        "T":
            "الإجابة صحيحة: العدسات ذات الطول البؤري الثابت، مثل 50 مم أو 85 مم، تستخدم بشكل رئيسي في تصوير البورتريه بفضل قدرتها على إنتاج تأثير خلفية ضبابية مميزة."
      },
    ],
    2: [
      {
        "q":
            "يفضل المصورون العدسات ذات الطول البؤري الثابت مثل 50 مم أو 85 مم في تصوير البورتريه لأن هذه العدسات ...................",
        "A1": "توفر زوايا رؤية أوسع وتقلل من تأثير Bokeh",
        "A2": "تقدم دقة أقل وتأثير ضبابي أكثر في الخلفية",
        "A3": "تركز الضوء بشكل أفضل وتساعد في الفصل بين الموضوع والخلفية",
        "A4": "تقدم صورة أقل وضوحًا وتكون أقل تكلفة",
        "a": 3,
        "Level": "I1MQ1",
        "isTF": false,
        "T":
            "الإجابة صحيحة: العدسات ذات الطول البؤري الثابت مثل 50 مم و85 مم تسمح بتركيز الضوء بشكل أفضل، مما يؤدي إلى تأثير Bokeh رائع وفصل دقيق بين الموضوع والخلفية."
      },
      {
        "q":
            "تعد العدسات ذات الطول البؤري الثابت مثالية لتصوير البورتريه لأنها.............",
        "A1": "تتيح إنتاج صورة عالية الدقة مع تأثير Bokeh رائع",
        "A2": "تحتوي على عدة عناصر بصرية أقل وجودة منخفضة",
        "A3": "توفر زاوية رؤية واسعة لجميع أنواع التصوير",
        "A4": "تمنحك القدرة على تصوير الصور المقربة فقط",
        "a": 1,
        "Level": "I1MQ2",
        "isTF": false,
        "T":
            "الإجابة صحيحة: العدسات ذات الطول البؤري الثابت توفر صورًا دقيقة وجميلة مع تأثير Bokeh مميز يجعل الخلفية ضبابية ويُبرز الموضوع بوضوح، مما يجعلها مثالية لتصوير البورتريه."
      },
    ],
    3: [
      {
        "q":
            "إذا كنت تقوم بتصوير بورتريه باستخدام عدسة ذات طول بؤري ثابت 50 مم بفتحة عدسة f/1.8 كيف سيؤثر هذا الإعداد على الصورة عند تصوير شخص على مسافة 2 متر؟",
        "A1": "سيؤدي إلى زيادة وضوح التفاصيل في الخلفية",
        "A2": "سيجعل الخلفية ضبابية، مما يبرز الموضوع بشكل أكبر",
        "A3": "سيؤدي إلى تشويش الصورة بسبب استخدام فتحة عدسة واسعة",
        "A4": "سيؤدي إلى تقليل عمق الميدان ويجعل الصورة أقل وضوحًا",
        "a": 2,
        "Level": "I1HQ1",
        "isTF": false,
        "T":
            "الإجابة صحيحة: باستخدام عدسة ذات طول بؤري ثابت 50 مم وفتحة عدسة f/1.8، سيقل عمق الميدان، مما يسبب ضبابية في الخلفية (Bokeh) ويجعل الموضوع في الصورة أكثر بروزًا ووضوحًا. هذا الإعداد مثالي لتصوير البورتريه، حيث يساعد في فصل الشخص عن الخلفية."
      },
      {
        "q":
            "إذا كنت تقوم بتصوير مشهد طبيعي باستخدام عدسة 50 مم بفتحة عدسة f/1.8. كيف سيؤثر هذا الإعداد على صورة المشهد؟",
        "A1": "ستتمكن من التقاط تفاصيل واضحة في الخلفية والموضوع في نفس الوقت",
        "A2": "ستحدث ضبابية في الخلفية وستركز العدسة على الموضوع القريب فقط",
        "A3": "ستؤدي فتحة العدسة الواسعة إلى تقليل جودة الصورة بشكل عام",
        "A4": "ستتمكن من التقاط الصورة بزاوية أوسع مع وضوح شامل",
        "a": 2,
        "Level": "I1HQ2",
        "isTF": false,
        "T":
            "الإجابة صحيحة: فتحة العدسة f/1.8 مع عدسة 50 مم ستنتج عمق ميدان ضحل، مما يعني أن الخلفية ستصبح ضبابية وتبرز الموضوع القريب. هذا الإعداد ليس مثاليًا للمشاهد الطبيعية التي تتطلب وضوحًا في الخلفية، ولكنه ممتاز لتركيز الضوء على الموضوع."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "الفائدة الرئيسية لاستخدام العدسات القابلة للتبديل في التصوير هي..................",
        "A1": "توفير مرونة أكبر للمصور من خلال التبديل بين العدسات حسب الحاجة",
        "A2": "تقليل وزن الكاميرا مما يسهل حملها أثناء التصوير",
        "A3": "تحسين دقة الصورة بفضل الفتحات الضيقة",
        "A4": "توفير زاوية رؤية ثابتة لجميع أنواع المشاهد",
        "a": 1,
        "Level": "I2EQ1",
        "isTF": false,
        "T":
            "العدسات القابلة للتبديل تتيح للمصور مرونة في اختيار العدسة المناسبة لكل مشهد، سواء كانت عدسة زووم أو واسعة الزاوية أو ماكرو، مما يعزز قدرة المصور على التكيف مع الظروف المختلفة."
      },
      {
        "q":
            "الفائدة الرئيسية لاستخدام عدسات الزوم في التصوير الفوتوغرافي هي.......................",
        "A1":
            "تتيح للمصور تغيير البُعد البؤري بسهولة للحصول على تقريب أو توسيع زاوية التصوير",
        "A2":
            "توفر تفاصيل دقيقة في تصوير الأجسام الصغيرة مثل الحشرات والنباتات",
        "A3": "تساعد في تصوير المشاهد الطبيعية بزاوية رؤية واسعة جدًا",
        "A4": "تقلل من التشوه في الصورة وتضمن دقة التفاصيل",
        "a": 1,
        "Level": "I2EQ2",
        "isTF": false,
        "T":
            "عدسات الزوم تحتوي على بُعد بؤري متغير، مما يسمح للمصور بالتبديل بين مختلف الزوايا بسهولة، وهي مثالية لتصوير الأحداث والمناظر الطبيعية والسفر."
      },
    ],
    2: [
      {
        "q":
            "كيف تساعد العدسات القابلة للتبديل، مثل عدسات الزوم أو العدسات الواسعة الزاوية، في تحسين تجربة التصوير في مشهد متنوع؟",
        "A1":
            "يمكن استخدامها لتقليل تشويش الصور من خلال تقليل عدد العناصر البصرية",
        "A2":
            "تتيح للمصور الانتقال بسهولة بين زوايا رؤية مختلفة دون تغيير مكان الكاميرا",
        "A3": "تزيد من تعقيد إعدادات الكاميرا وتؤثر سلبًا على جودة الصورة",
        "A4":
            "تعمل على تحسين عمق الميدان وجعل الصورة أكثر وضوحًا في جميع الظروف",
        "a": 2,
        "Level": "I2MQ1",
        "isTF": false,
        "T":
            "العدسات القابلة للتبديل، مثل عدسات الزوم والعدسات واسعة الزاوية، تتيح للمصور التبديل بسهولة بين أنواع مختلفة من الزوايا والمسافات البؤرية بدون الحاجة لتغيير مكان الكاميرا، مما يعزز مرونته في التقاط المشهد بشكل أفضل."
      },
      {
        "q":
            "تقوم باستخدام كاميرا مزودة بعدسة قابلة للتبديل ذات زاوية رؤية واسعة. هذه العدسة ...............",
        "A1": "ستساعد في زيادة وضوح الصورة مع الحفاظ على التفاصيل في الخلفية",
        "A2":
            "ستقلل من حدة التفاصيل في الخلفية وتساعد في تركيز الضوء على الموضوع",
        "A3":
            "ستجعل الصورة تظهر مشوهة بسبب تقليل المسافة بين الموضوع والكاميرا",
        "A4": "ستزيد من عمق الميدان وتؤثر على التباين في الصورة",
        "a": 1,
        "Level": "I2MQ2",
        "isTF": false,
        "T":
            "العدسة الواسعة الزاوية تسمح بدخول كمية أكبر من الضوء مع زاوية رؤية واسعة، مما يساعد في تحسين التفاصيل في المشاهد الطبيعية وتوفير وضوح في جميع أجزاء الصورة."
      },
    ],
    3: [
      {
        "q":
            "أنت تقوم بتصوير مهرجان ثقافي في الهواء الطلق، ويشمل الحشود والفعاليات المختلفة. يجب أن تلتقط صورًا للأشخاص عن قرب وفي نفس الوقت تلتقط صورًا للمشاهد البعيدة دون تغيير العدسة بشكل متكرر. ما العدسة التي ستستخدمها؟",
        "A1": "عدسة زووم 24-70 مم",
        "A2": "عدسة ماكرو",
        "A3": "عدسة فائقة الاتساع",
        "A4": "عدسة بُعد بؤري ثابت 85 مم",
        "a": 1,
        "Level": "I2HQ1",
        "isTF": false,
        "T":
            "عدسة الزووم مثل 24-70 مم هي الأنسب لهذا النوع من التصوير حيث تتيح لك التبديل بسهولة بين التقريب والتوسيع لتغطية حشود الناس أو المشاهد البعيدة دون الحاجة إلى تغيير العدسة بشكل متكرر."
      },
      {
        "q":
            "أنت في رحلة تصوير لمناظر طبيعية على قمة جبلية، وتريد أن تلتقط مشهدًا واسعًا للجبال مع تفاصيل دقيقة في المقدمة والخلفية. ما العدسة الأنسب التي ستساعدك في الحصول على أفضل صورة؟",
        "A1": "عدسة زووم 70-200 مم",
        "A2": "عدسة ماكرو",
        "A3": "عدسة فائقة الاتساع",
        "A4": "عدسة بُعد بؤري ثابت 50 مم",
        "a": 3,
        "Level": "I2HQ2",
        "isTF": false,
        "T":
            "العدسات فائقة الاتساع توفر زاوية تصوير واسعة جدًا، مما يجعلها مثالية لتصوير المناظر الطبيعية الواسعة، مما يساعدك على تضمين التفاصيل من المقدمة إلى الخلفية في الصورة بشكل واضح."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "الاستخدام الرئيسي للعدسات التيليفوتوغرافية هو......................",
        "A1": "تصوير المناظر الطبيعية الواسعة",
        "A2": "تصوير الأهداف البعيدة مثل الحياة البرية والرياضة",
        "A3": "التصوير الماكرو للأجسام الصغيرة جدًا",
        "A4": "التصوير المعماري",
        "a": 2,
        "Level": "I3EQ1",
        "isTF": false,
        "T":
            "العدسات التيليفوتوغرافية تتميز ببُعد بؤري طويل، مما يجعلها مثالية لتصوير الأهداف البعيدة مثل الحياة البرية والرياضة، مع الحفاظ على التفاصيل."
      },
      {
        "q":
            "تتميز العدسات التيليفوتوغرافية عن غيرها من العدسات بـ........................",
        "A1": "زاوية رؤية واسعة جدًا",
        "A2": "بُعد بؤري طويل يسمح بتصوير الأهداف البعيدة",
        "A3": "القدرة على التقاط صور ماكرو بتفاصيل دقيقة",
        "A4": "القدرة على تصوير الأماكن الضيقة",
        "a": 2,
        "Level": "I3EQ2",
        "isTF": false,
        "T":
            "العدسات التيليفوتوغرافية مصممة خصيصًا لتصوير الأهداف البعيدة مثل الحياة البرية والرياضة، بفضل بعدها البؤري الطويل."
      },
    ],
    2: [
      {
        "q":
            "السبب الرئيسي لاستخدام العدسات التيليفوتوغرافية في تصوير الأحداث الرياضية والحياة البرية هو لأنها ....................",
        "A1": "توفر زاوية رؤية واسعة تغطي مساحات كبيرة",
        "A2": "تسمح بالتصوير من مسافات بعيدة مع الحفاظ على تفاصيل الهدف",
        "A3": "تمتلك قدرة عالية على تقليل الضوضاء الرقمية في الصور",
        "A4": "تقلل من تأثير الإضاءة القوية على جودة الصورة",
        "a": 2,
        "Level": "I3MQ1",
        "isTF": false,
        "T":
            "العدسات التيليفوتوغرافية تتميز ببُعد بؤري طويل، مما يساعد المصورين على التقاط صور واضحة للأهداف البعيدة، مثل اللاعبين في الملاعب أو الحيوانات البرية، مع الحفاظ على التفاصيل والجودة العالية."
      },
      {
        "q":
            "تساعد العدسات التيليفوتوغرافية في التركيز على الهدف وعزله عن الخلفية عن طريق.......................",
        "A1": "زيادة زاوية الرؤية",
        "A2": "استخدام بُعد بؤري طويل وتقليل عمق المجال",
        "A3": "زيادة سرعة الغالق",
        "A4": "تقليل حساسية  ISO",
        "a": 2,
        "Level": "I3MQ2",
        "isTF": false,
        "T":
            "البعد البؤري الطويل في العدسات التيليفوتوغرافية يساعد في جعل الخلفية ضبابية (Bokeh) مما يعزل الهدف ويبرزه بوضوح."
      },
    ],
    3: [
      {
        "q":
            "أثناء تصوير مباراة كرة قدم بعدسة تيليفوتوغرافية، لاحظت أن الخلفية لا تزال واضحة جدًا، مما يقلل من التركيز على اللاعبين. كيف يمكنك تحسين عزل الهدف عن الخلفية للحصول على تأثير ضبابي أكثر؟",
        "A1":
            "استخدام عدسة تيليفوتوغرافية ببُعد بؤري أطول والتركيز على اللاعب المستهدف",
        "A2": "تقليل البعد البؤري للعدسة لتوسيع مجال الرؤية",
        "A3": "استخدام فتحة عدسة أضيق مثل f/16 لزيادة وضوح الخلفية",
        "A4": "تقريب الخلفية من الهدف لجعلها أكثر وضوحًا",
        "a": 1,
        "Level": "I3HQ1",
        "isTF": false,
        "T":
            "العدسات التيليفوتوغرافية تُستخدم لعزل الهدف عن الخلفية، وكلما زاد البعد البؤري، زاد تأثير الضبابية في الخلفية، مما يساعد في إبراز اللاعبين وجعل الصورة أكثر جاذبية."
      },
      {
        "q":
            "أثناء تصوير طائر بعيد باستخدام عدسة تيليفوتوغرافية، لاحظت أن الطائر لا يبدو معزولًا بشكل جيد عن الخلفية، مما يقلل من وضوحه في الصورة. ما هو الإجراء الأفضل للحصول على عزل أفضل للهدف؟",
        "A1": "استخدام عدسة تيليفوتوغرافية ببُعد بؤري أطول والتركيز على الطائر",
        "A2": "تقليل البعد البؤري للعدسة لزيادة مجال الرؤية",
        "A3": "اختيار فتحة عدسة ضيقة مثل f/16 لجعل الخلفية أكثر وضوحًا",
        "A4": "تقليل المسافة بين الطائر والخلفية لتوضيحها أكثر",
        "a": 1,
        "Level": "I3HQ2",
        "isTF": false,
        "T":
            "العدسات التيليفوتوغرافية تساعد في عزل الهدف من خلال استخدام بُعد بؤري طويل، مما يؤدي إلى ضبابية الخلفية ويجعل الطائر أكثر وضوحًا وبارزًا في الصورة."
      },
    ],
  },
  {
    1: [
      {
        "q": "الاستخدام الأساسي لعدسات Tilt-Shift  هو.......................",
        "A1": "تصوير الأهداف البعيدة مثل الحياة البرية والرياضة",
        "A2": "التحكم في زاوية التقاط الصورة وتصحيح التشوهات",
        "A3": "التقاط صور بزاوية واسعة جدًا للمناظر الطبيعية",
        "A4": "التصوير الماكرو للأجسام الصغيرة جدًا",
        "a": 2,
        "Level": "I4EQ1",
        "isTF": false,
        "T":
            "تُستخدم عدسات Tilt-Shift بشكل أساسي في تصوير الهندسة المعمارية والمشاهد الواسعة، حيث تساعد في تصحيح التشوهات الناتجة عن زاوية التصوير."
      },
      {
        "q": "تعد عدسات Tilt-Shift مثالية لتصوير........................",
        "A1": "الحياة البرية والمشاهد الطبيعية",
        "A2": "الهندسة المعمارية والمشاهد الواسعة",
        "A3": "البورتريه والتركيز على التفاصيل الدقيقة",
        "A4": "المناظر الليلية والتصوير تحت الإضاءة المنخفضة",
        "a": 2,
        "Level": "I4EQ2",
        "isTF": false,
        "T":
            "عدسات Tilt-Shift مثالية لتصوير الهندسة المعمارية والمشاهد الواسعة لأنها تسمح بالتحكم في زاوية التقاط الصورة وتصحيح التشوهات، مما يجعلها مفيدة في الحفاظ على الخطوط المستقيمة في المباني وتوسيع زاوية الرؤية في المشاهد الواسعة."
      },
    ],
    2: [
      {
        "q":
            "تعد عدسات Tilt-Shift  مفيدة في تصوير المباني والهندسة المعمارية لأنها.......................",
        "A1": "توفر زوايا تصوير منخفضة فقط",
        "A2": "تمنع ظهور خطوط المباني بشكل مائل وغير متناسق",
        "A3": "تزيد من تأثير الخلفية الضبابية  (Bokeh)",
        "A4": "تساعد في تقريب الأجسام البعيدة دون تغيير موقع المصور",
        "a": 2,
        "Level": "I4MQ1",
        "isTF": false,
        "T":
            "عند تصوير المباني بعدسات تقليدية، قد تبدو الخطوط الرأسية مائلة بسبب زاوية التصوير، لكن عدسات Tilt-Shift تسمح بتصحيح هذا التشوه للحصول على منظور طبيعي أكثر."
      },
      {
        "q":
            "الوظيفة الأساسية لخاصية Shift  في عدسات Tilt-Shift هي..........................",
        "A1": "تغيير زاوية العدسة بالنسبة للهدف",
        "A2": "تحريك العدسة للأعلى أو لأسفل لتصحيح التشوهات الرأسية",
        "A3": "زيادة أو تقليل عمق المجال",
        "A4": "تكبير الهدف من مسافات بعيدة",
        "a": 2,
        "Level": "I4MQ2",
        "isTF": false,
        "T":
            "خاصية Shift تتيح للمصور تحريك العدسة للأعلى أو لأسفل دون تغيير زاوية الكاميرا، مما يساعد في تصحيح التشوهات مثل ميلان الخطوط الرأسية للمباني في التصوير المعماري."
      },
    ],
    3: [
      {
        "q":
            "أنت تصور ناطحة سحاب باستخدام عدسة عادية، ولكنك تلاحظ أن المبنى يبدو وكأنه يميل للخلف في الصورة. كيف يمكنك تصحيح هذا التشوه باستخدام عدسة Tilt-Shift؟",
        "A1": "إمالة (Tilt) العدسة إلى الأسفل لتصحيح الميل",
        "A2":
            "استخدام ميزة الإزاحة (Shift) لرفع العدسة دون تغيير زاوية الكاميرا",
        "A3": "تقليل البعد البؤري للعدسة للحصول على مجال رؤية أوسع",
        "A4": "زيادة فتحة العدسة لجعل الخلفية أكثر ضبابية",
        "a": 2,
        "Level": "I2HQ1",
        "isTF": false,
        "T":
            "عند تصوير المباني، يمكن أن تبدو الخطوط الرأسية مائلة بسبب زاوية الكاميرا، لكن باستخدام ميزة Shift في العدسات Tilt-Shift، يمكن تصحيح التشوه وجعل الخطوط مستقيمة دون الحاجة إلى تعديل زاوية الكاميرا."
      },
      {
        "q":
            "أنت تستخدم عدسة Tilt-Shift لتصوير مشهد معماري، ولكنك ترغب في زيادة التركيز على جزء معين من المبنى مع ترك أجزاء أخرى غير واضحة. كيف يمكنك تحقيق ذلك؟",
        "A1":
            "تعديل زاوية العدسة باستخدام Tilt لتغيير اتجاه التركيز على جزء معين من المبنى",
        "A2": "تحريك العدسة للأعلى أو لأسفل باستخدام Shift",
        "A3": "زيادة البُعد البؤري للحصول على تأثير ضبابية أقوى",
        "A4": "تقليل عمق المجال باستخدام فتحة عدسة ضيقة",
        "a": 1,
        "Level": "I2HQ2",
        "isTF": false,
        "T":
            "باستخدام خاصية Tilt، يمكنك تغيير زاوية العدسة بالنسبة للهدف، مما يسمح لك بتحديد منطقة التركيز بشكل دقيق على جزء معين من المشهد."
      },
    ],
  },
  // ------------
  {
    1: [
      {
        "q": "ما هي الوظيفة الأساسية لفتحة العدسة في الكاميرا؟",
        "A1": "تحديد مستوى الإضاءة في الصورة",
        "A2": "السماح بدخول الضوء إلى الكاميرا",
        "A3": "تحسين جودة الصورة",
        "A4": "تقليل دقة الصورة",
        "a": 2,
        "Level": "I5EQ1",
        "isTF": false,
        "T":
            "فتحة العدسة هي الفتحة التي يدخل الضوء من خلالها إلى داخل الكاميرا، مما يؤثر على كمية الضوء التي تصل إلى مستشعر الكاميرا."
      },
      {
        "q": "وحدة قياس فتحة العدسة هي:",
        "A1": "f/stop",
        "A2": "بكسل",
        "A3": "درجة الحرارة",
        "A4": "نسبة الإضاءة",
        "a": 1,
        "Level": "I5EQ2",
        "isTF": false,
        "T":
            "فتحة العدسة تُقاس باستخدام وحدة الـ f/stop، مثل f/1.4 أو f/16، وهي تحدد حجم الفتحة التي يدخل منها الضوء إلى الكاميرا."
      },
    ],
    2: [
      {
        "q": "أي من العوامل التالية يزيد من عمق الميدان في الصورة؟",
        "A1": "فتحة العدسة الواسعة مثل (f/1.4)",
        "A2": "البعد البؤري للعدسة الطويل (مثل 85 مم)",
        "A3": "المسافة بين الكاميرا والهدف الكبيرة",
        "A4": "فتحة العدسة الصغيرة مثل f/16",
        "a": 4,
        "Level": "I5ةQ1",
        "isTF": false,
        "T":
            "فتحة العدسة الصغيرة مثل f/16 تزيد من عمق الميدان، مما يساعد على إبقاء التفاصيل واضحة في جميع أنحاء الصورة، سواء في المقدمة أو الخلفية."
      },
      {
        "q":
            "التأثير الرئيسي لاستخدام عدسة ذات طول بؤري طويل (مثل 85 مم) على عمق الميدان؟",
        "A1": "زيادة عمق الميدان",
        "A2": "تقليل عمق الميدان",
        "A3": "جعل الصورة مشوشة تمامًا",
        "A4": "زيادة الإضاءة في الصورة",
        "a": 2,
        "Level": "I5ةQ2",
        "isTF": false,
        "T":
            "العدسات ذات الطول البؤري الطويل (مثل 85 مم) تُقلل من عمق الميدان، مما يجعل الهدف في الصورة واضحًا مع خلفية ضبابية."
      },
    ],
    3: [
      {
        "q":
            "أنت مصور محترف وتستعد لالتقاط صورة لحدث رياضي في وقت متأخر من المساء. الإضاءة في المكان منخفضة للغاية، وتريد عزل اللاعبين عن الخلفية لإبراز حركتهم. ما هي الإعدادات المثلى للعدسة في هذه الحالة؟",
        "A1": "عدسة 50 مم مع فتحة f/1.4",
        "A2": "عدسة 24-70 مم مع فتحة f/16",
        "A3": "عدسة 200 مم مع فتحة f/2.8",
        "A4": "عدسة 16-35 مم مع فتحة f/8",
        "a": 1,
        "Level": "I5HQ1",
        "isTF": false,
        "T":
            "في هذه الحالة، فتحة العدسة الواسعة مثل f/1.4 ستسمح بدخول كمية كبيرة من الضوء في البيئة منخفضة الإضاءة، كما ستساعد على عزل اللاعبين عن الخلفية بفضل عمق الميدان الضحل، مما يبرز الحركة في الصورة."
      },
      {
        "q":
            "أنت مصور حفلات زفاف في مكان مفتوح أثناء النهار. ترغب في تصوير صورة جماعية مع الحفاظ على وضوح التفاصيل في جميع الأشخاص، من الأمام إلى الخلف. ما هي الإعدادات المثالية للحصول على عمق ميدان واسع؟",
        "A1": "عدسة 85 مم مع فتحة f/1.4",
        "A2": "عدسة 16-35 مم مع فتحة f/16",
        "A3": "عدسة 50 مم مع فتحة f/2.8",
        "A4": "عدسة 70-200 مم مع فتحة f/4",
        "a": 2,
        "Level": "I5HQ2",
        "isTF": false,
        "T":
            "استخدام عدسة واسعة الزاوية مثل 16-35 مم مع فتحة عدسة صغيرة مثل f/16 يساعد على الحفاظ على وضوح جميع الأشخاص في الصورة من الأمام إلى الخلف."
      },
    ],
  },

  {
    1: [
      {
        "q": "البعد البؤري للعدسة هو .....................",
        "A1": "المسافة بين العدسة والهدف",
        "A2": "المسافة بين نقطة تجمع الضوء والمستشعر",
        "A3": "المسافة بين العدسة والمستشعر",
        "A4": "المسافة بين الكاميرا والمصور",
        "a": 2,
        "Level": "I6EQ1",
        "isTF": false,
        "T":
            "البعد البؤري هو المسافة بين نقطة تجمع الضوء والمستشعر ويتم قياسه بالمليمتر."
      },
      {
        "q":
            "عند تصوير النجوم في ليلة مظلمة. الإعدادات التي تضمن جمع الضوء الكافي دون زيادة قيمة ISO بشكل مفرط هي استخدام عدسة بفتحة ....................",
        "A1": "f/16",
        "A2": "f/8",
        "A3": "f/2.8",
        "A4": "f/4",
        "a": 3,
        "Level": "I6EQ2",
        "isTF": false,
        "T":
            "عند تصوير النجوم في بيئة مظلمة، من المهم استخدام عدسة بفتحة واسعة مثل f/2.8، حيث تسمح بدخول كمية كافية من الضوء دون الحاجة لزيادة ISO بشكل مفرط، مما يساعد في تقليل الضوضاء في الصورة."
      },
    ],
    2: [
      {
        "q":
            "كيف يؤثر استخدام فتحة عدسة واسعة مثل f/2.8 على عمق الميدان عند التصوير باستخدام عدسة ذات بعد بؤري طويل؟",
        "A1": "يزيد عمق الميدان",
        "A2": "يقل عمق الميدان",
        "A3": "لا يؤثر على عمق الميدان",
        "A4": "يزيد وضوح التفاصيل في الخلفية",
        "a": 2,
        "Level": "I6MQ1",
        "isTF": false,
        "T":
            "عند استخدام فتحة عدسة واسعة مع عدسة ذات بعد بؤري طويل، يتم تقليل عمق الميدان مما يعزل الموضوع عن الخلفية ويجعلها ضبابية."
      },
      {
        "q":
            "أي من الخيارات التالية يعكس العلاقة بين فتحة العدسة والمسافة عند استخدام عدسة ذات بعد بؤري طويل؟",
        "A1": "كلما ابتعدت عن الموضوع، زادت العزلة بين الموضوع والخلفية",
        "A2": "كلما اقتربت من الموضوع، زادت العزلة بين الموضوع والخلفية",
        "A3": "المسافة لا تؤثر على العزلة بين الموضوع والخلفية",
        "A4": "المسافة تؤثر فقط في زاوية الرؤية",
        "a": 2,
        "Level": "I6MQ2",
        "isTF": false,
        "T":
            "عند التقاط صور على مسافات قصيرة باستخدام عدسات ذات بعد بؤري طويل وفتحة واسعة، تصبح العزلة بين الموضوع والخلفية أكبر، مما يجعل الخلفية ضبابية."
      },
    ],
    3: [
      {
        "q":
            "أنت مصور فوتوغرافي وتريد التقاط صورة لزهرة باستخدام عدسة ماكرو مع فتحة واسعة. ما هو التأثير المتوقع على عمق الميدان في هذه الحالة؟",
        "A1": "زيادة عمق الميدان",
        "A2": "تقليل عمق الميدان بشكل كبير",
        "A3": "الحفاظ على التفاصيل في الخلفية",
        "A4": "جعل الخلفية أكثر وضوحًا",
        "a": 2,
        "Level": "I6HQ1",
        "isTF": false,
        "T":
            "عند التصوير باستخدام عدسة ماكرو وفتحة واسعة، يقل عمق الميدان بشكل كبير، مما يبرز الموضوع بشكل أكبر ويجعل الخلفية ضبابية."
      },
      {
        "q":
            "أنت تلتقط صورة لسيارة تسير بسرعة على الطريق السريع في وقت الظهيرة. ما هي الإعدادات التي تضمن لك الحصول على صورة حادة مع خلفية ضبابية تعزز من تأثير الحركة؟",
        "A1": "استخدام عدسة 200 مم مع فتحة f/22",
        "A2": "استخدام عدسة 70-200 مم مع فتحة f/2.8",
        "A3": "استخدام عدسة 16-35 مم مع فتحة f/8",
        "A4": "استخدام عدسة 24 مم مع فتحة f/16",
        "a": 2,
        "Level": "I6HQ2",
        "isTF": false,
        "T":
            "عدسة ذات بعد بؤري طويل 70-200 مم مع فتحة عدسة واسعة f/2.8  ستساعد في تقليل عمق الميدان، مما يبرز السيارة في الصورة ويجعل الخلفية ضبابية، مما يعزز من تأثير الحركة."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "العنصر الذي يتحكم في كمية الضوء الداخل إلى الكاميرا هو.....................",
        "A1": "ISO",
        "A2": "فتحة العدسة",
        "A3": "سرعة الغالق",
        "A4": "Auto HDR",
        "a": 2,
        "Level": "I7EQ1",
        "isTF": false,
        "T":
            "فتحة العدسة هي العنصر الذي يحدد مقدار الضوء الذي يدخل إلى الكاميرا من خلال تغيير حجم الفتحة."
      },
      {
        "q":
            "الإعداد المناسب لتصوير مشهد بإضاءة منخفضة هو.........................",
        "A1": "فتحة صغيرة (f/16)، سرعة غالق سريعة (1/500)، ISO منخفضة (100)",
        "A2":
            "فتحة واسعة (f/2.8)، سرعة غالق بطيئة (1/30)، ISO مرتفعة (800-3200)",
        "A3": "فتحة صغيرة (f/11)، سرعة غالق متوسطة (1/250)، ISO منخفضة (200)",
        "A4": "فتحة واسعة (f/2.8)، سرعة غالق سريعة (1/500)، ISO منخفضة (200)",
        "a": 2,
        "Level": "I7EQ2",
        "isTF": false,
        "T":
            "في ظروف الإضاءة المنخفضة، نحتاج إلى فتحة عدسة واسعة وسرعة غالق بطيئة لزيادة كمية الضوء الداخل إلى الكاميرا."
      },
    ],
    2: [
      {
        "q":
            "أي من السيناريوهات التالية يعكس الاستخدام الصحيح لمرشحات الكثافة المحايدة (ND Filters)؟",
        "A1": "عند تصوير مشهد ليلي لتقليل الضوضاء البصرية (Noise)",
        "A2": "عند تصوير شلالات في وضح النهار للحصول على تأثير المياه الناعمة",
        "A3": "عند تصوير رياضي متحرك بسرعة عالية في ملعب مضاء جيدًا",
        "A4": "عند الرغبة في زيادة سطوع الصورة في بيئة منخفضة الإضاءة",
        "a": 2,
        "Level": "I7MQ1",
        "isTF": false,
        "T":
            "مرشحات ND تقلل كمية الضوء الداخل إلى الكاميرا، مما يسمح باستخدام سرعات غالق بطيئة حتى في ضوء النهار، مما يساعد في إنشاء تأثيرات سلسة في الحركة مثل تدفق الماء أو سحب ضبابية."
      },
      {
        "q": "في أي من الحالات التالية يُفضل استخدام ISO منخفض؟",
        "A1": "عند تصوير الأحداث الرياضية في إضاءة منخفضة",
        "A2": "عند التصوير في وضح النهار مع إضاءة جيدة",
        "A3": "عند الحاجة إلى زيادة سرعة الغالق في بيئة مظلمة",
        "A4": "عند الرغبة في زيادة حساسية الكاميرا للضوء لتقليل الضوضاء",
        "a": 2,
        "Level": "I7MQ2",
        "isTF": false,
        "T":
            "استخدام ISO منخفض (مثل 100 أو 200) في ضوء النهار يساعد في تقليل التشويش (Noise) والحفاظ على جودة الصورة، بينما رفع ISO يكون ضروريًا في الإضاءة المنخفضة."
      },
    ],
    3: [
      {
        "q":
            "إذا كنت تريد التقاط صورة ذات تعريض متوازن في بيئة ذات تباين إضاءة شديد (مثل مشهد يحتوي على مناطق شديدة السطوع والظل)، فما الإعداد الأكثر ملاءمة؟",
        "A1": "استخدام فتحة ضيقة (f/16) مع ISO منخفضة (100)",
        "A2": "استخدام تقنية Auto HDR لدمج تعريضات مختلفة",
        "A3": "زيادة سرعة الغالق مع تقليل فتحة العدسة",
        "A4": "رفع حساسية ISO إلى أعلى مستوى ممكن",
        "a": 2,
        "Level": "I7HQ1",
        "isTF": false,
        "T":
            "تقنية Auto HDR تتيح دمج تعريضات مختلفة لنفس المشهد لإظهار التفاصيل في كل من الظلال والمناطق الساطعة."
      },
      {
        "q":
            "إذا كنت ترغب في تصوير مشهد ليلي بدون ضوضاء رقمية عالية، ما هو الخيار الأفضل؟",
        "A1": "رفع ISO إلى 3200 أو أكثر",
        "A2": "استخدام فتحة عدسة واسعة (f/1.8) مع سرعة غالق بطيئة",
        "A3": "تقليل سرعة الغالق لأقل من 1/10 مع ISO منخفضة جدًا",
        "A4": "استخدام مرشحات ND لتقليل الإضاءة",
        "a": 2,
        "Level": "I7HQ2",
        "isTF": false,
        "T":
            "استخدام فتحة واسعة يسمح بدخول مزيد من الضوء، بينما تساعد سرعة الغالق البطيئة على التقاط إضاءة كافية دون الحاجة إلى رفع ISO بشكل يؤدي إلى زيادة الضوضاء."
      },
    ],
  },
  // ------------
  {
    1: [
      {
        "q": "تحتوي ......................... على بعد بؤري ثابت.",
        "A1": "عدسات الزوم",
        "A2": "عدسات الماكرو",
        "A3": "العدسات الأساسية (Prime Lenses)",
        "A4": "عدسات التيليفوتو",
        "a": 3,
        "Level": "I8EQ1",
        "isTF": false,
        "T":
            "العدسات الأساسية تحتوي على بعد بؤري ثابت وتتميز بجودة صورة عالية وفتحة عدسة واسعة، مما يجعلها مثالية للتصوير في الإضاءة المنخفضة."
      },
      {
        "q": "يُفضل استخدام ..................... عند تصوير المناظر الطبيعية.",
        "A1": "عدسات ماكرو",
        "A2": "عدسات التيليفوتو",
        "A3": "العدسات واسعة الزاوية (Wide Angle)",
        "A4": "العدسات الأساسية",
        "a": 3,
        "Level": "I8EQ2",
        "isTF": false,
        "T":
            "العدسات الواسعة توفر زاوية رؤية أكبر، مما يسمح بالتقاط مساحات واسعة، وهي مثالية لتصوير المناظر الطبيعية والهندسة المعمارية."
      },
    ],
    2: [
      {
        "q":
            "العدسة المناسبة لتصوير الحشرات والتفاصيل الدقيقة هي .....................",
        "A1": "70-200 مم",
        "A2": "100 مم",
        "A3": "50 مم f/1.8",
        "A4": "16-35 مم",
        "a": 2,
        "Level": "I8MQ1",
        "isTF": false,
        "T":
            "عدسات الماكرو 100 مم مصممة خصيصًا لتصوير الأجسام الصغيرة جدًا مثل الحشرات والزهور، حيث توفر تفاصيل دقيقة ونسبة تكبير عالية."
      },
      {
        "q":
            "العدسة المناسبة لتصوير الأهداف البعيدة مثل الحياة البرية والرياضة هي....................",
        "A1": "50 مم f/1.8",
        "A2": "16-35 مم",
        "A3": "70-200 مم",
        "A4": "100 مم",
        "a": 3,
        "Level": "I8MQ2",
        "isTF": false,
        "T":
            "عدسات التيليفوتو 70-200 مم تُستخدم للتصوير من مسافات بعيدة، مما يجعلها مثالية لتصوير الحياة البرية والأحداث الرياضية."
      },
    ],
    3: [
      {
        "q":
            "أنت مكلف بتصوير حدث رياضي يتضمن سباق سيارات، وتحتاج إلى التقاط صور واضحة للسيارات أثناء حركتها السريعة. أي نوع من العدسات سيكون الأنسب لهذه المهمة؟",
        "A1": "عدسة 100 مم",
        "A2": "عدسة 16-35 مم",
        "A3": "عدسة 70-200 مم",
        "A4": "عدسة 50 مم f/1.8",
        "a": 3,
        "Level": "I8HQ1",
        "isTF": false,
        "T":
            "العدسات التيليفوتو 70-200 مم توفر القدرة على التقاط صور واضحة من مسافات بعيدة، وهو أمر ضروري عند تصوير الأحداث الرياضية والحياة البرية، حيث يصعب الاقتراب من الهدف."
      },
      {
        "q":
            "إذا كنت ترغب في التقاط صورة لمبنى شاهق يظهر بالكامل في الإطار دون الحاجة إلى الابتعاد كثيرًا، أي نوع من العدسات سيكون الأكثر فعالية؟",
        "A1": "عدسة 100 مم",
        "A2": "عدسة 16-35 مم",
        "A3": "عدسة 70-200 مم",
        "A4": "عدسة 50 مم f/1.8",
        "a": 2,
        "Level": "I8HQ2",
        "isTF": false,
        "T":
            "العدسات واسعة الزاوية 16-35 مم مثالية لتصوير الهندسة المعمارية، حيث تسمح بالتقاط مشاهد واسعة حتى من مسافات قريبة، مما يجعلها مناسبة لتصوير المباني والمناظر الطبيعية."
      },
    ],
  },
  {
    1: [
      {
        "q":
            "إذا كنت ترغب في شراء عدسة مناسبة لتصوير البورتريه، فما هو البعد البؤري المناسب؟",
        "A1": "أقل من 35 مم",
        "A2": "50-85 مم",
        "A3": "أكثر من 100 مم",
        "A4": "16 مم",
        "a": 2,
        "Level": "I9EQ1",
        "isTF": false,
        "T":
            "العدسات ذات البعد البؤري بين 50-85 مم هي المثالية لتصوير البورتريه، حيث توفر مظهرًا طبيعيًا للوجه مع تأثير خلفية ضبابية جميل."
      },
      {
        "q":
            "أي من فتحات العدسة التالية تعد مثالية للتصوير في الإضاءة المنخفضة؟",
        "A1": "f/1.8",
        "A2": "f/4",
        "A3": "f/5.6",
        "A4": "f/8",
        "a": 1,
        "Level": "I9EQ2",
        "isTF": false,
        "T":
            "كلما كانت فتحة العدسة أوسع مثل f/1.8 أو f/2.8، زادت كمية الضوء الداخلة، مما يجعلها مثالية للتصوير في الإضاءة المنخفضة وإنتاج خلفيات ضبابية رائعة."
      },
    ],
    2: [
      {
        "q":
            "ما هي الاعتبارات الأساسية التي يجب التركيز عليها عند شرائك عدسة لتصوير منظر طبيعي في ظروف ضوء ساطع؟",
        "A1": "عدسة 50 مم f/1.8",
        "A2": "عدسة 16-35 مم f/4",
        "A3": "عدسة 70-200 مم f/2.8",
        "A4": "عدسة 85 مم f/1.4",
        "a": 2,
        "Level": "I9MQ1",
        "isTF": false,
        "T":
            "عدسة واسعة الزاوية مثل 16-35 مم f/4 توفر زاوية رؤية واسعة مع الحفاظ على تفاصيل دقيقة في الصورة عند التصوير في ظروف الإضاءة الساطعة."
      },
      {
        "q":
            "ما هي الاعتبارات الأساسية التي يجب التركيز عليها عند شرائك عدسة لضمان الحصول على صور عالية الجودة من مسافة بعيدة في ظروف الإضاءة المتغيرة؟",
        "A1": "عدسة بفتحة عدسة ضيقة مثل f/5.6",
        "A2": "عدسة زوم مع قدرة على تعديل البعد البؤري بسرعة مثل 24-70 مم",
        "A3": "عدسة تيليفوتو مع فتحة عدسة واسعة مثل f/2.8",
        "A4": "عدسة ماكرو مع فتحة عدسة ضيقة لزيادة العمق",
        "a": 3,
        "Level": "I9MQ2",
        "isTF": false,
        "T":
            "العدسات التيليفوتو مثل 70-200 مم f/2.8 مثالية لتصوير الأحداث الرياضية، حيث توفر لك القدرة على تصوير الأهداف البعيدة مع ضمان الحفاظ على التفاصيل وضبط العمق. فتحة العدسة الواسعة مفيدة في ظروف الإضاءة المتغيرة."
      },
    ],
    3: [
      {
        "q":
            "أنت في حاجة إلى عدسة لتصوير مشهد طبيعي واسع في ضوء نهاري قوي، بحيث تحافظ على كل التفاصيل في الصورة مع تجنب الإضاءة الزائدة. أي من هذه العدسات ستكون الأنسب مع الأخذ في الاعتبار فتحة العدسة والبعد البؤري؟",
        "A1": "عدسة 50 مم f/1.4",
        "A2": "عدسة 16-35 مم f/4",
        "A3": "عدسة 70-200 مم f/2.8",
        "A4": "عدسة 100 مم f/2.8",
        "a": 2,
        "Level": "I9HQ1",
        "isTF": false,
        "T":
            "عدسة واسعة الزاوية مثل 16-35 مم مع فتحة عدسة f/4 مثالية لتصوير المناظر الطبيعية في ضوء النهار، حيث توفر زاوية رؤية واسعة وتضمن تفاصيل حادة في الصورة بفضل الفتحة الضيقة."
      },
      {
        "q":
            "أنت في حاجة إلى عدسة لالتقاط صورة بورتريه مع الحفاظ على وضوح الوجه وخلفية ضبابية، أي من هذه العدسات ستكون الأنسب مع الأخذ في الاعتبار فتحة العدسة والبعد البؤري؟",
        "A1": "عدسة 50 مم f/1.4 مع خلفية ضبابية خفيفة",
        "A2": "عدسة 24-70 مم f/4 مع وضوح أكبر في الخلفية",
        "A3": "عدسة 85 مم f/1.8 مع عمق مجال ضحل",
        "A4": "عدسة 16-35 مم f/4 مع تفاصيل واضحة في كل شيء",
        "a": 3,
        "Level": "I9HQ2",
        "isTF": false,
        "T":
            "عدسة 85 مم f/1.8 هي واحدة من أفضل العدسات للبورتريه، حيث تتيح لك التحكم في عمق المجال للحصول على خلفية ضبابية رائعة مع وضوح كامل للوجه في المقدمة."
      },
    ],
  },
];
